Repository: pypi-data/pypi-mirror-19
Catalog: packages/collective.contact.facetednav/collective.contact.facetednav-1.1.5.tar.gz/collective.contact.facetednav-1.1.5/src/collective/contact/facetednav/locales/*/LC_MESSAGES/collective.contact.facetednav.po
Languages: de

source: Contacts
de: Kontakte

source: Contacts actions disabled
de: Kontakte Aktionen deaktiviert

source: Contacts actions enabled
de: Kontakte Aktionen aktiv

source: Delete selected contacts
de: Ausgewählte Kontakte löschen

source: Delete this contact
de: Diesen Kontakt löschen

source: Disable actions
de: Aktionen deaktivieren

source: Enable actions
de: Aktionen aktivieren

source: Excel export
de: Exportieren in Excel

source: Organizations
de: Organisationen

source: Persons
de: Personen

source: Select all
de: Alle auswählen

source: Unauthorized: ${path}
de: Nicht autorisiert: ${path}

source: Unselect all
de: „Auswahl alle“ aufheben

source: confirm_delete_selection
de: Sollen $num ausgewählte Inhalt(e) wirklich entfernt werden?

source: help_no_result
de: Zu den gesuchten Kriterien konnte kein Kontakt gefunden werden.

source: msg_objects_delete_failed
de: ${num} Objekt(e) wurden nicht gelöscht: ${fails}

source: msg_objects_deleted
de: ${num} Objekt(e) gelöscht

source: selected_contacts_num
de: Ausgewählte Kontakte: ${num}
