Repository: pypi-data/pypi-mirror-19
Catalog: packages/cubicweb-mediaplayer/cubicweb-mediaplayer-0.2.2.tar.gz/cubicweb-mediaplayer-0.2.2/i18n/*.po
Languages: fr

source: Between 0 and 1
fr: Entre 0 et 1

# EncodingTask
source: encoding task for
fr: Tâche d'encodage

# EncodingTask_plural
source: Encoding tasks
fr: Tâches d'encodage

source: GB
fr: Go

source: MB
fr: Mo

source: Media
fr: Média

source: N/A
fr: ND

source: New encoding task
fr: Nouvelle tâche d'encodage

source: New sound file
fr: Nouveau fichier son

source: New video file
fr: Nouveau fichier Vidéo

source: Order
fr: Ordre

source: Reencoding state
fr: État du réencodage

# SoundFile
source: title
fr: Ficher son

# SoundFile_plural
source: Sound files
fr: Fichers son

source: TB
fr: To

source: This encoding task
fr: Cette tâche d'encodage

source: This encoding task:
fr: Cette tâche d'encodage :

# This SoundFile
source: This soudn file
fr: Ce fichier son

source: This sound file:
fr: Ce fichier son :

source: This video file
fr: Ce fichier vidéo

source: This video file:
fr: Ce fichier vidéo :

# VideoFile
source: width
fr: Vidéo

# VideoFile_plural
source: Video files
fr: Vidéos

source: add EncodingTask target_media_entity SoundFile object
fr: une tâche d'encodage

source: add EncodingTask target_media_entity VideoFile object
fr: une tâche d'encodage

# add a EncodingTask
source: add an encoding task
fr: Ajouter une tâche d'encodage

source: add a sound file
fr: Ajouter un fichier son

source: add a video file
fr: Ajouter une vidéo

# creating EncodingTask (EncodingTask target_media_entity SoundFile %(linkto)s)
source: creating an encoding task (for this sound file %(linkto)s)
fr: Créer une tâche d'encodage pour %(linkto)s

# creating EncodingTask (EncodingTask target_media_entity VideoFile %(linkto)s)
source: creating an encoding task (for this video file %(linkto)s)
fr: Créer une tâche d'encodage pour %(linkto)s

# VideoFile
source: width
fr: données

# SoundFile
source: title
fr: format d'encodage des donées

# VideoFile
source: width
fr: format d'encodage des donées

# SoundFile
source: title
fr: format

# VideoFile
source: width
fr: format

source: data_mp3
fr: données (mp3)

# SoundFile
source: title
fr: données (mp3)

# SoundFile
source: title
fr: nom du fichier mp3

source: data_mp4
fr: données (mp4)

# VideoFile
source: width
fr: données (mp4)

# data_mp4_name
source: mp4 file name
fr: nom du fichier (mp4)

# VideoFile
source: width
fr: nom du fichier (mp4)

# SoundFile
source: title
fr: nom du fichier

# VideoFile
source: width
fr: nom du fichier

source: data_oga
fr: données (ogg)

# SoundFile
source: title
fr: données (ogg)

# data_oga_name
source: ogg sound file name
fr: nom du fichier (ogg)

# SoundFile
source: title
fr: nom du fichier (ogg)

source: data_ogv
fr: données (ogg)

# VideoFile
source: width
fr: données (ogg)

# data_ogv_name
source: ogg video file name
fr: nom du fichier (ogg)

# VideoFile
source: width
fr: nom du fichier (ogg)

source: data_webm
fr: données (webm)

# VideoFile
source: width
fr: données (webm)

# data_webm_name
source: webm file name
fr: nom du fichier (webm)

# VideoFile
source: width
fr: nom du fichier (webm)

# SoundFile
source: title
fr: format de la description

# VideoFile
source: width
fr: format de la description

source: encoding of the file when it applies (e.g. text). Should be dynamically set at upload time.
fr: format d'encodage du fichier (normalement rempli automatiquement)

source: height
fr: hauteur

# VideoFile
source: width
fr: hauteur

source: kB
fr: ko

source: length
fr: durée

# SoundFile
source: title
fr: durée

# VideoFile
source: width
fr: durée

source: operation
fr: opération

# EncodingTask
source: encoding task for
fr: opération

source: performer %s not found
fr: performeur %s non trouvé

source: poster_of
fr: jaquette de

# File
source: cover of
fr: jaquette de

# poster_of_object
source: has cover
fr: jaquette

# VideoFile
source: width
fr: jaquette

source: progress
fr: avancement

# EncodingTask
source: encoding task for
fr: avancement

source: reencoding date
fr: date de réencodage

source: reencoding of %s
fr: réencodage de %s

# stderr
source: standard error output
fr: sortie d'erreur standard

# EncodingTask
source: encoding task for
fr: sortie d'erreur standard

# stdout
source: standard output
fr: sortie standard

# EncodingTask
source: encoding task for
fr: sortie standard

# target_media_entity
source: encoding task for
fr: tâche de réencodage de

# EncodingTask
source: encoding task for
fr: tâche de réencodage de

# target_media_entity_object
source: encoded by
fr: réencodé par

# SoundFile
source: title
fr: réencodé par

# VideoFile
source: width
fr: réencodé par

# task_abort
source: abort
fr: annuler

# task_aborted
source: aborted
fr: annulé

# task_acquire
source: acquire
fr: acquérir

# task_assigned
source: assigned
fr: acquis

# task_complete
source: complete
fr: terminer

# task_done
source: done
fr: terminé

# task_fail
source: fail
fr: erreur

# task_failed
source: failed
fr: en erreur

# task_pending
source: pending
fr: en queue

# task_release
source: release
fr: relâcher

# SoundFile
source: title
fr: titre du fichier son

# VideoFile
source: width
fr: titre de la vidéo

source: track length in secs
fr: durée en secondes

source: width
fr: largeur

# VideoFile
source: width
fr: largeur
