Repository: pypi-data/pypi-mirror-19
Catalog: packages/cubicweb-vcrs/cubicweb-vcrs-0.2.1.tar.gz/cubicweb-vcrs-0.2.1/i18n/*.po
Languages: fr

source: RepositoryStats
fr: Statistiques entrepôt

source: RepositoryStats_plural
fr: Statistiques entrepôt

source: nb_closed
fr: patches fermés

# RepositoryStats
source: nb_closed
fr: patches fermés

source: nb_in_progress
fr: patches en cours

# RepositoryStats
source: nb_in_progress
fr: patches en cours

source: nb_other
fr: autres patches

# RepositoryStats
source: nb_other
fr: autres patches

source: nb_rejected
fr: patches rejetés

# RepositoryStats
source: nb_rejected
fr: patches rejetés

source: nb_validating
fr: patches en validation

# RepositoryStats
source: nb_validating
fr: patches en validation

source: number of patches in the "applied" state
fr: nombre de patches dans l'état 'appliqué'

source: number of patches in the "folded" or "outdated" state
fr: nombre de patches dans l'état 'fusionné' ou 'obsolète'

source: number of patches in the "in-progress" state
fr: nombre de patches dans l'état 'en cours'

source: number of patches in the "pending-review" or "reviewed" state
fr: nombre de patches dans l'état 'attente de revue' ou 'revue'

source: number of patches in the "rejected" or "deprecated" state
fr: nombre de patches dans l'état 'rejeté' ou 'déprécié'
