Repository: pypi-data/pypi-mirror-19
Catalog: packages/collective.contact.facetednav/collective.contact.facetednav-1.1.6.tar.gz/collective.contact.facetednav-1.1.6/src/collective/contact/facetednav/locales/*/LC_MESSAGES/collective.contact.facetednav.po
Languages: sl

source: Contacts
sl: Kontakti

source: Contacts actions disabled
sl: Dejanja povezana s kontakti onemogočena

source: Contacts actions enabled
sl: Dejana povezana s kontakti omogočena

source: Delete selected contacts
sl: Izbriši izbrane kontakte

source: Delete this contact
sl: Izbriši ta kontakt

source: Disable actions
sl: Onemogoči dejanje

source: Enable actions
sl: Omogoči dejanje

source: Excel export
sl: Excel poročilo

source: Organizations
sl: Organizacije

source: Persons
sl: Osebe

source: Select all
sl: Izberi vse

source: Unauthorized: ${path}
sl: Neavtorizirano: ${path}

source: Unselect all
sl: Odpravi izbiro za vse

source: confirm_delete_selection
sl: Ali ste prepričani,da želite izbrisati ${num} izbranih predmetov?

source: help_no_result
sl: Ni kontakta, ki bi ustrezal vašim kriterijem.

source: msg_objects_delete_failed
sl: ${num} izbranih predmetov ni bilo mogoče izbrisati: ${fails}

source: msg_objects_deleted
sl: ${num} izbranih predmetov je bilo izbrisanih

source: selected_contacts_num
sl: Izbrani kontakti: ${num}
