Repository: pypi-data/pypi-mirror-19
Catalog: packages/ishtar/ishtar-0.99.6.tar.gz/ishtar-0.99.6/translations/*/archaeological_warehouse.po
Languages: fr

source: Warehouse
fr: Dépôt

source: Order
fr: Ordre

source: Name
fr: Nom

source: Warehouse type
fr: Type de dépôt

source: Town
fr: Commune

source: Warehouse search
fr: Rechercher un dépôt

source: Person in charge
fr: Responsable

source: Comment
fr: Commentaires

source: Address
fr: Adresse

source: Address complement
fr: Complément d'adresse

source: Postal code
fr: Code postal

source: Country
fr: Pays

source: Phone
fr: Téléphone

source: Mobile phone
fr: Téléphone mobile

source: Would you like to delete this warehouse?
fr: Voulez-vous supprimer ce dépôt ?

source: Container
fr: Contenant

source: Ref.
fr: Réf.

source: Container type
fr: Type de contenant

source: Current location (warehouse)
fr: Lieu actuel (dépôt)

source: Responsible warehouse
fr: Dépôt responsable

source: This ID already exists for this warehouse.
fr: Cet identifiant existe déjà pour ce dépôt.

source: Container search
fr: Rechercher un contenant

source: You should select a container.
fr: Vous devez sélectionner un contenant.

source: Add a new container
fr: Ajouter un nouveau contenant

source: Packaging
fr: Conditionnement

source: Packager
fr: Personne assurant le conditionnement

source: Packaged finds
fr: Mobilier conditionné

source: Would you like to delete this container?
fr: Voulez-vous supprimer ce contenant ?

source: Treatment
fr: Traitement

source: Search
fr: Recherche

source: Creation
fr: Ajout

source: Deletion
fr: Suppression

source: Containers
fr: Contenants

source: Warehouse types
fr: Types de dépôts

source: Warehouses
fr: Dépôts

source: Can view all Warehouses
fr: Peut voir tous les Dépôts

source: Can view own Warehouse
fr: Peut voir son propre Dépôt

source: Can add own Warehouse
fr: Peut ajouter son propre Dépôt

source: Can change own Warehouse
fr: Peut modifier son propre Dépôt

source: Can delete own Warehouse
fr: Peut supprimer son propre Dépôt

source: Warehouse division
fr: Division de dépôt

source: Warehouse divisions
fr: Divisions de dépôt

source: Length (mm)
fr: Longueur (mm)

source: Width (mm)
fr: Largeur (mm)

source: Height (mm)
fr: Hauteur (mm)

source: Container types
fr: Types de contenant

source: Location - index
fr: Lieu - index

source: Precise localisation
fr: Localisation précise

source: Location (warehouse)
fr: Lieu (dépôt)

source: Container ref.
fr: Réf. du contenant

source: Cached location
fr: Lieu - en cache

source: Reference
fr: Référence

source: Container localisation
fr: Localisation de contenant

source: Container localisations
fr: Localisations de contenant

source: Warehouse creation
fr: Ajouter un dépôt

source: Warehouse modification
fr: Modifier un dépôt

source: Warehouse deletion
fr: Supprimer un dépôt

source: Container creation
fr: Ajouter un contenant

source: Container modification
fr: Modifier un contenant

source: Container deletion
fr: Supprimer un contenant

source: Content
fr: Contenu

source: Attached containers
fr: Contenants associés

source: No division set for this warehouse. Define it to localise container in this warehouse.
fr: Pas de division configurée pour ce dépôt. Définissez une division pour localiser un contenant dans ce dépôt.
