Repository: pypi-data/pypi-mirror-19
Catalog: packages/pixelcms-server/pixelcms-server-0.4.2.tar.gz/pixelcms-server-0.4.2/cms/locale/*/LC_MESSAGES/django.po
Languages: pl

source: Accounts
pl: Konta

source: Provided username is already taken.
pl: Podana nazwa użytkownika jest już zajęta.

source: Provided email address is already taken.
pl: Podany adres email jest już zajęty.

source: Passwords do not match.
pl: Hasła nie pasują do siebie.

source: Current password is invalid.
pl: Obecne hasło jest nieprawidłowe.

source: Email address associated with this account is already taken.
pl: Adres email powiązany z tym kontem jest już zajęty.

source: Your accounts has been created. To activate it click on link below, or copy it to your browser.
pl: Twoje konto zostało utworzone. Aby je aktywować kliknij w link poniżej, lub skopiuj go do przeglądarki.

source: Activate your account
pl: Aktywuj swoje konto

source: To change you password click on link below, or copy it to your browser.
pl: Aby zmienić swoje hasło kliknij w link poniżej, lub skopiuj go do przeglądarki.

source: Change your password
pl: Zmień swoje hasło

source: To change you email click on link below, or copy it to your browser.
pl: Aby zmienić swój email kliknij w link poniżej, lub skopiuj go do przeglądarki.

source: You have been logged in.
pl: Zalogowano.

source: Wrong username or password.
pl: Nieprawidłowa nazwa użytkownika, lub hasło.

source: Your account has been created. Activation message has been sent to provided email address.
pl: Twoje konto zostało utworzone. Wiadomość aktywacyjna została wysłana na podany adres email.

source: You account has been created. You can log in.
pl: Twoje konto zostało utworzone. Możesz się zalogować.

source: Activation key is invalid.
pl: Klucz aktywacyjny jest nieprawidłowy.

source: Your account is now active. You can log in.
pl: Twoje konto zostało aktywowane. Możesz się zalogować.

source: Activation key is not associated with any account that needs activation.
pl: Klucz aktywacyjny nie jest powiązany z żadnym kontem wymagającym aktywacji.

source: Activation key has expired.
pl: Klucz aktywacyjny wygasł.

source: Activation message has been sent to provided email address.
pl: Wiadomość aktywacyjna została wysłana na podany adres email.

source: Provided email is not associated with any account that needs to be activated.
pl: Podany adres email nie jest powiązany z żadnym kontem wymagającym aktywacji.

source: Message with instructions how to change your password has been sent to provided email address.
pl: Wiadomość z instrukcjami jak zmienić hasło została wysłana na podany adres email.

source: Provided email is not associated with any account.
pl: Podany adres email nie jest powiązany z żadnym kontem.

source: Change password key is invalid.
pl: Klucz zmiany hasła jest nieprawidłowy.

source: Your password has been changed. You can log in.
pl: Twoje hasło zostało zmienione. Możesz się zalogować.

source: Change password key has expired.
pl: Klucz zmiany hasła wygasł.

source: Your password has been changed.
pl: Twoje hasło zostało zmienione.

source: Confirmation messages has been sent to provided email address.
pl: Wiadomość potwierdzająca została wysłana na podany adres email.

source: Your email has been changed.
pl: Twoje email został zmieniony.

source: Confirmation key is invalid.
pl: Klucz potwierdzający jest nieprawidłowy.

source: Confirmation key has expired.
pl: Klucz potwierdzający wygasł.

source: Failed to duplicate "{}".
pl: Nie udało się powielić "{}".

source: Duplicate selected items
pl: Powiel zaznaczone elementy.

source: Admin addons
pl: Dodatki administracyjne

source: Content
pl: Treść

source: Pages
pl: Strony

source: Modules
pl: Moduły

source: Emails
pl: Emaile

source: Settings
pl: Ustawienia

source: Users
pl: Użytkownicy

source: Files
pl: Pliki

source: Manage files
pl: Zarządzaj plikami

source: Change password
pl: Zmień hasło

source: Log out
pl: Wyloguj się

source: View site
pl: Pokaż stronę

source: Documentation
pl: Dokumentacja

source: any
pl: dowolny

source: name
pl: nazwa

source: published
pl: opublikowano

source: template id
pl: Identyfikator w szablonie

source: show module name
pl: Pokazuj nazwę modułu

source: module name header level
pl: Poziom nagłówka nazwy modułu

source: HTML class
pl: klasa HTML

source: language
pl: język

source: Module settings
pl: Ustawienia modułu

source: page title override
pl: Nadpisanie tytułu strony

source: site name suffix in page title
pl: Sufiks nazwy serwisu w tytule strony

source: description override
pl: Nadpisanie opisu

source: robots override
pl: Nadpisanie robotów

source: SEO options
pl: Opcje SEO

source: Overrides values from <a href="/admin/settings/settings/" target="_blank">global settings</a>.
pl: Nadpisuje wartości z <a href="/admin/settings/settings/" target="_blank">ustawień globalnych</a>.

source: Routes
pl: Ścieżki

source: Category view settings - general
pl: Ustawienia widoku kategorii - ogólne

source: Category view settings - subcategories
pl: Ustawienia widoku kategorii - subkategorie

source: Category view settings - articles
pl: Ustawienia widoku kategorii - artykuły

source: Article view settings
pl: Ustawienia widoku artykułów

source: Image
pl: Obrazek

source: <strong>Intro</strong> is displayed in category view and article view, <strong>Content</strong> is displayed only in article view.
pl: <strong>Wstęp</strong> jest wyświetlany w widoku kategorii i widoku artykułu, <strong>Treść</strong> jest wyświetlana tylko w widoku artykułu.

source: View settings
pl: Ustawienia ogólne

source: Dates
pl: Daty

source: Content module
pl: Moduł treści

source: Articles module
pl: Moduł artykułów

source: Categories module
pl: Moduł kategorii

source: order
pl: kolejność

source: parent
pl: rodzic

source: description
pl: opis

source: image
pl: obrazek

source: show description
pl: pokazuj opis

source: show image
pl: pokazuj obrazek

source: image size
pl: rozmiar obrazka

source: show bradcrumbs
pl: pokazuj ścieżkę powrotu

source: show back link
pl: pokazuj link powrotu

source: show descriptions
pl: pokazuj opisy

source: show images
pl: pokazuj obrazki

source: images size
pl: rozmiar obrazków

source: show intros
pl: pokazuj wstępy

source: show contents
pl: pokazuj treści

source: show creation dates
pl: pokazuj daty utworzenia

source: pagination
pl: paginacja

source: articles on page
pl: ilość artykułów na stronie

source: category
pl: kategoria

source: categories
pl: kategorie

source: title
pl: tytuł

source: intro
pl: wstęp

source: content
pl: treść

source: thumbnail
pl: miniaturka

source: Displayed in category view.
pl: Wyświetlane w widoku kategorii.

source: show creation date
pl: pokazuj datę utworzenia

source: show breadcrumbs
pl: pokazuj ścieżkę powrotu

source: images thumbnails size
pl: Rozmiar miniaturek obrazków

source: creation date
pl: data utworzenia

source: last modification date
pl: data ostatniej modyfikacji

source: article
pl: artykuł

source: articles
pl: artykuły

source: images
pl: obrazki

source: content module
pl: moduł treści

source: content modules
pl: moduły treści

source: articles limit
pl: limit artykułów

source: show titles
pl: pokazuj tytuły

source: titles headers level
pl: poziom nagłówków nazw

source: articles module
pl: moduł artykułu

source: articles modules
pl: moduły artykułów

source: show names
pl: pokazuj nazwy

source: names headers level
pl: poziom nagłówków nazw

source: categories module
pl: moduł kategorii

source: categories modules
pl: moduły kategorii

source: Mass message has been queued for sending.
pl: Wiadomość masowa została zakolejkowana do wysłania.

source: Mass message object does not exist or has been already sent.
pl: Obiekt wiadomości masowej nie istnieje, lub wiadomość została już wysłana.

source: Send
pl: Wyślij

source: subject
pl: temat

source: recipients
pl: odbiorcy

source: reply to
pl: odpowiedź do

source: created
pl: utworzono

source: sent
pl: wysłano

source: postdate
pl: data wysłania

source: message
pl: wiadomość

source: messages
pl: wiadomości

source: mass message
pl: wiadomość masowa

source: mass messages
pl: wiadomości masowe

source: (not provided)
pl: (nie podano)

source: Name / company name
pl: Imię i nazwisko / nazwa firmy

source: Email address
pl: Adres email

source: Phone number
pl: Numer telefonu

source: Contact form message
pl: Wiadomość z formularza kontaktowego

source: Navigation
pl: Nawigacja

source: nav module
pl: moduł nawigacji

source: nav modules
pl: moduły nawigacji

source: nav
pl: nawigacja

source: Overrides <strong>Page</strong> title. Required when nav scrolls to element or is link.
pl: Nadpisuje tytuł <strong>Strony</strong>. Wymagane kiedy element nawigacji przewija do elementu, lub jest linkiem.

source: page
pl: strona

source: scroll to element
pl: przewiń do elementu

source: HTML id of element on page. Overrides <strong>Page</strong>.
pl: Identyfikator HTML elementu na stronie. Nadpisuje <strong>Stronę</strong>.

source: Overrides <strong>Page</strong> and <strong>Scroll to element</strong>.
pl: Nadpisuje <strong>Stronę</strong> i <strong>Przewiń do elementu</strong>.

source: open link in new tab
pl: otwórz link w nowej karcie

source: item
pl: element

source: items
pl: elementy

source: Category page
pl: Strona kategorii

source: Page type
pl: Typ strony

source: homepage
pl: strona główna

source: react component name
pl: nazwa komponentu React

source: Leave it blank to use default component.
pl: Pozostaw puste, aby użyć domyślnego komponentu.

source: pages
pl: strony

source: category page
pl: strona kategorii

source: category pages
pl: strony kategorii

source: article page
pl: strona artykułu

source: article pages
pl: strony artykułów

source: custom component page
pl: strona z własnym komponentem

source: custom component pages
pl: strony z własnym komponentem

source: site name
pl: nazwa serwisu

source: suffix separator
pl: separator sufiksu

source: robots
pl: roboty

source: general settings
pl: Ustawienia ogólne
