Repository: pypi-data/pypi-mirror-19
Catalog: packages/formbar/formbar-0.24.3.tar.gz/formbar-0.24.3/formbar/locale/*/LC_MESSAGES/formbar.po
Languages: de

source: This field is required. You must provide a value
de: Dieses Feld ist verpflichtend. Sie müssen einen Wert angeben.

source: This field is desired. Please provide a value
de: Dieses Feld ist erwünscht. Bitte geben Sie einen Wert an.

source: Value '%s' must be in format 'HH:MM:SS'
de: Wert '%s' muss im Format 'HH:MM:SS' vorliegen

source: Value '%s' is too large
de: Wert '%s' ist zu groß

source: %s is not a valid date format.
de: %s ist kein valides Format für ein Datum.

source: %s is not a valid datetime format.
de: %s ist kein valides Format für ein Datum/Zeit.

source: %s is not a string value.
de: %s is keine Zeichenkette.

source: %s is not a integer value.
de: %s ist kein Ganzzahlenwert.

source: %s is not a float value.
de: %s is kein Fließkommawert.

source: %s is not valid email address.
de: %s ist keine valide E-Mail-Adresse.

source: %s is not a boolean value.
de: %s ist kein boolescher Wert.

source: %s is not a file value.
de: %s ist keine Datei.

source: no selection
de: keine Auswahl

source: Submit
de: Speichern

source: Submit and proceed
de: Speichern und weiter

source: Outline
de: Gliederung

source: Preview
de: Vorschau

source: This is just a basic editor for formbar forms. The preview of the forms will have no outline, no dynamic nor will show application specific fields. Instead of those the default textfield will be rendered.
de: Dies ist nur ein einfacher Editor für formbar Formulare. Die Vorschau wird keine Gliederung, keine dynamischen Inhalte noch anwendungsspezifische Felder beinhalten. Anstelle dieser werden die Vorgabe Felder gerendert.

source: Required field
de: Pflichtfeld

source: characters remaining
de: Zeichen verbleiben
