Repository: pypi-data/pypi-mirror-19
Catalog: packages/django-internationalflavor/django-internationalflavor-0.3.1.tar.gz/django-internationalflavor-0.3.1/internationalflavor/locale/*/LC_MESSAGES/django.po
Languages: ur

source: Gulf Standard Time
ur: خلیج کا معیاری وقت

source: Guyana Time
ur: گیانا کا وقت

source: Hawaii-Aleutian Time
ur: ہوائی الیوٹیئن ٹائم

source: Hong Kong Time
ur: ہانگ کانگ ٹائم

source: Hovd Time
ur: ہووڈ ٹائم

source: India Standard Time
ur: ہندوستان کا معیاری وقت

source: Indian Ocean Time
ur: بحر ہند ٹائم

source: Indochina Time
ur: ہند چین ٹائم

source: Central Indonesia Time
ur: وسطی انڈونیشیا ٹائم

source: Eastern Indonesia Time
ur: مشرقی انڈونیشیا ٹائم

source: Western Indonesia Time
ur: مغربی انڈونیشیا ٹائم

source: Iran Time
ur: ایران کا وقت

source: Irkutsk Time
ur: ارکتسک ٹائم

source: Israel Time
ur: اسرائیل کا وقت

source: Japan Time
ur: جاپان ٹائم

source: Petropavlovsk-Kamchatski Time
ur: پیٹروپاؤلووسک-کیمچسکی ٹائم

source: East Kazakhstan Time
ur: مشرقی قزاخستان کا وقت

source: West Kazakhstan Time
ur: مغربی قزاخستان کا وقت

source: Korean Time
ur: کوریا ٹائم

source: Kosrae Time
ur: کوسرے ٹائم

source: Krasnoyarsk Time
ur: کریسنویارسک ٹائم

source: Kyrgystan Time
ur: کرغستان کا وقت

source: Line Islands Time
ur: لائن آئلینڈز ٹائم

source: Lord Howe Time
ur: لارڈ ہووے ٹائم

source: Macquarie Island Time
ur: مکوآری آئلینڈ کا وقت

source: Magadan Time
ur: میگیدن ٹائم

source: Malaysia Time
ur: ملیشیا ٹائم

source: Maldives Time
ur: مالدیپ کا وقت

source: Marquesas Time
ur: مارکیسس ٹائم

source: Marshall Islands Time
ur: مارشل آئلینڈز ٹائم

source: Mauritius Time
ur: ماریشس ٹائم

source: Mawson Time
ur: ماؤسن ٹائم

source: Northwest Mexico Time
ur: شمال مغربی میکسیکو ٹائم

source: Mexican Pacific Time
ur: میکسیکن پیسفک ٹائم

source: Ulan Bator Time
ur: یولان بیتور ٹائم

source: Moscow Time
ur: ماسکو ٹائم

source: Myanmar Time
ur: میانمار ٹائم

source: Nauru Time
ur: ناؤرو ٹائم

source: Nepal Time
ur: نیپال کا وقت

source: New Caledonia Time
ur: نیو کیلیڈونیا ٹائم

source: New Zealand Time
ur: نیوزی لینڈ کا وقت

source: Newfoundland Time
ur: نیو فاؤنڈ لینڈ ٹائم

source: Niue Time
ur: نیئو ٹائم

source: Norfolk Island Time
ur: نارفوک آئلینڈ کا وقت

source: Fernando de Noronha Time
ur: فرنانڈو ڈی نورنہا کا وقت

source: Novosibirsk Time
ur: نوووسیبرسک ٹائم

source: Omsk Time
ur: اومسک ٹائم

source: Pakistan Time
ur: پاکستان کا وقت

source: Palau Time
ur: پلاؤ ٹائم

source: Papua New Guinea Time
ur: پاپوآ نیو گنی ٹائم

source: Paraguay Time
ur: پیراگوئے کا وقت

source: Peru Time
ur: پیرو کا وقت

source: Philippine Time
ur: فلپائن ٹائم

source: Phoenix Islands Time
ur: فینکس آئلینڈز ٹائم

source: St. Pierre & Miquelon Time
ur: سینٹ پیئر اور مکلیئون ٹائم

source: Pitcairn Time
ur: پٹکائرن ٹائم

source: Ponape Time
ur: پوناپے ٹائم

source: Reunion Time
ur: ری یونین ٹائم

source: Rothera Time
ur: روتھیرا کا وقت

source: Sakhalin Time
ur: سخالین ٹائم

source: Samara Time
ur: سمارا ٹائم

source: Samoa Time
ur: ساموآ ٹائم

source: Seychelles Time
ur: سیشلیز ٹائم

source: Singapore Standard Time
ur: سنگاپور سٹینڈرڈ ٹائم

source: Solomon Islands Time
ur: سولمن آئلینڈز ٹائم

source: South Georgia Time
ur: جنوبی جارجیا ٹائم

source: Suriname Time
ur: سورینام کا وقت

source: Syowa Time
ur: سیووا ٹائم

source: Tahiti Time
ur: تاہیتی ٹائم

source: Taipei Time
ur: تائی پیئی ٹائم

source: Tajikistan Time
ur: تاجکستان کا وقت

source: Tokelau Time
ur: ٹوکیلاؤ ٹائم

source: Tonga Time
ur: ٹونگا ٹائم

source: Chuuk Time
ur: چوک ٹائم

source: Turkmenistan Time
ur: ترکمانستان کا وقت

source: Tuvalu Time
ur: ٹوالو ٹائم

source: Uruguay Time
ur: یوروگوئے کا وقت

source: Uzbekistan Time
ur: ازبکستان کا وقت

source: Vanuatu Time
ur: وانوآٹو ٹائم

source: Venezuela Time
ur: وینزوئیلا کا وقت

source: Vladivostok Time
ur: ولادی ووستک ٹائم

source: Volgograd Time
ur: وولگوگراد ٹائم

source: Vostok Time
ur: ووسٹاک کا وقت

source: Wake Island Time
ur: ویک آئلینڈ ٹائم

source: Wallis & Futuna Time
ur: والیز اور فٹونا ٹائم

source: Yakutsk Time
ur: یکوتسک ٹائم

source: Yekaterinburg Time
ur: یکاٹیرِنبرگ ٹائم

source: %s Time
ur: %s وقت
