Repository: pypi-data/pypi-mirror-19
Catalog: packages/django-internationalflavor/django-internationalflavor-0.3.1.tar.gz/django-internationalflavor-0.3.1/internationalflavor/locale/*/LC_MESSAGES/django.po
Languages: ur

source: World
ur: دنیا

source: Africa
ur: افریقہ

source: North America
ur: شمالی امریکہ

source: South America
ur: جنوبی امریکہ

source: Oceania
ur: اوشیانیا

source: Western Africa
ur: مغربی افریقہ

source: Central America
ur: وسطی امریکہ

source: Eastern Africa
ur: مشرقی افریقہ

source: Northern Africa
ur: شمالی افریقہ

source: Middle Africa
ur: وسطی افریقہ

source: Southern Africa
ur: جنوبی افریقہ کے علاقہ

source: Americas
ur: امیریکاز

source: Northern America
ur: شمالی امریکہ کا علاقہ

source: Caribbean
ur: کریبیائی

source: Eastern Asia
ur: مشرقی ایشیا

source: Southern Asia
ur: جنوبی ایشیا

source: Southeast Asia
ur: جنوب مشرقی ایشیا

source: Southern Europe
ur: جنوبی یورپ

source: Australasia
ur: آسٹریلیشیا

source: Melanesia
ur: مالینیشیا

source: Micronesian Region
ur: مائکرونیشیائی علاقہ

source: Polynesia
ur: پولینیشیا

source: Asia
ur: ایشیا

source: Central Asia
ur: وسطی ایشیا

source: Western Asia
ur: مغربی ایشیا

source: Europe
ur: یورپ

source: Eastern Europe
ur: مشرقی یورپ

source: Northern Europe
ur: شمالی یورپ

source: Western Europe
ur: مغربی یورپ

source: Latin America
ur: لاطینی امریکہ

source: Ascension Island
ur: اسینشن آئلینڈ

source: Andorra
ur: انڈورا

source: United Arab Emirates
ur: متحدہ عرب امارات

source: Afghanistan
ur: افغانستان

source: Antigua & Barbuda
ur: انٹیگوا اور باربودا

source: Anguilla
ur: انگوئیلا

source: Albania
ur: البانیہ

source: Armenia
ur: آرمینیا

source: Angola
ur: انگولا

source: Antarctica
ur: انٹارکٹیکا

source: Argentina
ur: ارجنٹینا

source: American Samoa
ur: امریکی ساموآ

source: Austria
ur: آسٹریا

source: Australia
ur: آسٹریلیا

source: Aruba
ur: اروبا

source: Åland Islands
ur: آلینڈ آئلینڈز

source: Azerbaijan
ur: آذربائجان

source: Bosnia & Herzegovina
ur: بوسنیا اور ہرزیگووینا

source: Barbados
ur: بارباڈوس

source: Bangladesh
ur: بنگلہ دیش

source: Belgium
ur: بیلجیم

source: Burkina Faso
ur: برکینا فاسو

source: Bulgaria
ur: بلغاریہ

source: Bahrain
ur: بحرین

source: Burundi
ur: برونڈی

source: Benin
ur: بینن

source: St. Barthélemy
ur: سینٹ برتھلیمی

source: Bermuda
ur: برمودا

source: Brunei
ur: برونئی

source: Bolivia
ur: بولیویا

source: Caribbean Netherlands
ur: کریبیائی نیدرلینڈز

source: Brazil
ur: برازیل

source: Bahamas
ur: بہاماس

source: Bhutan
ur: بھوٹان

source: Bouvet Island
ur: بؤویٹ آئلینڈ

source: Botswana
ur: بوتسوانا

source: Belarus
ur: بیلاروس

source: Belize
ur: بیلائز

source: Canada
ur: کینیڈا

source: Cocos (Keeling) Islands
ur: کوکوس (کیلنگ) جزائر

source: Congo - Kinshasa
ur: کانگو - کنشاسا

source: Central African Republic
ur: وسط افریقی جمہوریہ

source: Congo - Brazzaville
ur: کانگو - برازاویلے

source: Switzerland
ur: سوئٹزر لینڈ

source: Côte d’Ivoire
ur: کوٹ ڈی آئیوری

source: Cook Islands
ur: کک آئلینڈز

source: Chile
ur: چلی

source: Cameroon
ur: کیمرون

source: China
ur: چین

source: Colombia
ur: کولمبیا

source: Clipperton Island
ur: کلپرٹن آئلینڈ

source: Costa Rica
ur: کوسٹا ریکا

source: Cuba
ur: کیوبا

source: Cape Verde
ur: کیپ ورڈی

source: Curaçao
ur: کیوراکاؤ

source: Christmas Island
ur: کرسمس آئلینڈ

source: Cyprus
ur: قبرص

source: Czech Republic
ur: چیک جمہوریہ

source: Germany
ur: جرمنی

source: Diego Garcia
ur: ڈائجو گارسیا

source: Djibouti
ur: جبوتی

source: Denmark
ur: ڈنمارک

source: Dominica
ur: ڈومنیکا

source: Dominican Republic
ur: ڈومنیکن جمہوریہ

source: Algeria
ur: الجیریا

source: Ceuta & Melilla
ur: سیئوٹا اور میلیلا

source: Ecuador
ur: ایکواڈور

source: Estonia
ur: اسٹونیا

source: Egypt
ur: مصر

source: Western Sahara
ur: مغربی صحارا

source: Eritrea
ur: اریٹیریا

source: Spain
ur: ہسپانیہ

source: Ethiopia
ur: ایتھوپیا

source: European Union
ur: یوروپی یونین

source: Finland
ur: فن لینڈ

source: Fiji
ur: فجی

source: Falkland Islands
ur: فاکلینڈ جزائر

source: Micronesia
ur: مائکرونیشیا

source: Faroe Islands
ur: جزائر فارو

source: France
ur: فرانس

source: Gabon
ur: گیبون

source: United Kingdom
ur: سلطنت متحدہ

source: Grenada
ur: گریناڈا

source: Georgia
ur: جارجیا

source: French Guiana
ur: فرینچ گیانا

source: Guernsey
ur: گوئرنسی

source: Ghana
ur: گھانا

source: Gibraltar
ur: جبل الطارق

source: Greenland
ur: گرین لینڈ

source: Gambia
ur: گامبیا

source: Guinea
ur: گنی

source: Guadeloupe
ur: گواڈیلوپ

source: Equatorial Guinea
ur: استوائی گیانا

source: Greece
ur: یونان

source: South Georgia & South Sandwich Islands
ur: جنوبی جارجیا اور جنوبی سینڈوچ جزائر

source: Guatemala
ur: گواٹے مالا

source: Guam
ur: گوآم

source: Guinea-Bissau
ur: گنی بساؤ

source: Guyana
ur: گیانا

source: Hong Kong
ur: ہانگ کانگ

source: Heard & McDonald Islands
ur: ہیئرڈ آئلینڈ اور میکڈونالڈ آئلینڈز

source: Honduras
ur: ہونڈاروس

source: Croatia
ur: کروشیا

source: Haiti
ur: ہیتی

source: Hungary
ur: ہنگری

source: Canary Islands
ur: کینری آئلینڈز

source: Indonesia
ur: انڈونیشیا

source: Ireland
ur: آئرلینڈ

source: Israel
ur: اسرائیل

source: Isle of Man
ur: آئل آف مین

source: India
ur: بھارت

source: British Indian Ocean Territory
ur: برطانوی ہندوستانی سمندری خطہ

source: Iraq
ur: عراق

source: Iran
ur: ایران

source: Iceland
ur: آئس لینڈ

source: Italy
ur: اٹلی

source: Jersey
ur: جرسی

source: Jamaica
ur: جمائیکا

source: Jordan
ur: اردن

source: Japan
ur: جاپان

source: Kenya
ur: کینیا

source: Kyrgyzstan
ur: کرغزستان

source: Cambodia
ur: کمبوڈیا

source: Kiribati
ur: کریباتی

source: Comoros
ur: کوموروس

source: St. Kitts & Nevis
ur: سینٹ کٹس اور نیویس

source: North Korea
ur: شمالی کوریا

source: South Korea
ur: جنوبی کوریا

source: Kuwait
ur: کویت

source: Cayman Islands
ur: کیمین آئلینڈز

source: Kazakhstan
ur: قزاخستان

source: Laos
ur: لاؤس

source: Lebanon
ur: لبنان

source: St. Lucia
ur: سینٹ لوسیا

source: Liechtenstein
ur: لیشٹنسٹائن

source: Sri Lanka
ur: سری لنکا

source: Liberia
ur: لائبیریا

source: Lesotho
ur: لیسوتھو

source: Lithuania
ur: لتھوانیا

source: Luxembourg
ur: لگژمبرگ

source: Latvia
ur: لٹویا

source: Libya
ur: لیبیا

source: Morocco
ur: مراقش

source: Monaco
ur: موناکو

source: Moldova
ur: مالدووا

source: Montenegro
ur: مونٹے نیگرو

source: St. Martin
ur: سینٹ مارٹن

source: Madagascar
ur: مڈغاسکر

source: Marshall Islands
ur: مارشل آئلینڈز

source: Macedonia
ur: مقدونیہ

source: Mali
ur: مالی

source: Myanmar (Burma)
ur: میانمار (برما)

source: Mongolia
ur: منگولیا

source: Macau
ur: مکاؤ

source: Northern Mariana Islands
ur: شمالی ماریانا آئلینڈز

source: Martinique
ur: مارٹینک

source: Mauritania
ur: موریطانیہ

source: Montserrat
ur: مونٹسیراٹ

source: Malta
ur: مالٹا

source: Mauritius
ur: ماریشس

source: Maldives
ur: مالدیپ

source: Malawi
ur: ملاوی

source: Mexico
ur: میکسیکو

source: Malaysia
ur: ملیشیا

source: Mozambique
ur: موزمبیق

source: Namibia
ur: نامیبیا

source: New Caledonia
ur: نیو کلیڈونیا

source: Niger
ur: نائجر

source: Norfolk Island
ur: نارفوک آئلینڈ

source: Nigeria
ur: نائجیریا

source: Nicaragua
ur: نکاراگووا

source: Netherlands
ur: نیدر لینڈز

source: Norway
ur: ناروے

source: Nepal
ur: نیپال

source: Nauru
ur: نؤرو

source: Niue
ur: نیئو

source: New Zealand
ur: نیوزی ینڈ

source: Oman
ur: عمان

source: Panama
ur: پنامہ

source: Peru
ur: پیرو

source: French Polynesia
ur: فرانسیسی پولینیشیا

source: Papua New Guinea
ur: پاپوآ نیو گنی

source: Philippines
ur: فلپائنی

source: Pakistan
ur: پاکستان

source: Poland
ur: پولینڈ

source: St. Pierre & Miquelon
ur: سینٹ پیئر اور میکلیئون

source: Pitcairn Islands
ur: پٹکائرن جزائر

source: Puerto Rico
ur: پیورٹو ریکو

source: Palestine
ur: فلسطین

source: Portugal
ur: پرتگال

source: Palau
ur: پلاؤ

source: Paraguay
ur: پیراگوئے

source: Qatar
ur: قطر

source: Outlying Oceania
ur: بیرونی اوشیانیا

source: Réunion
ur: ری یونین

source: Romania
ur: رومانیا

source: Serbia
ur: سربیا

source: Russia
ur: روس

source: Rwanda
ur: روانڈا

source: Saudi Arabia
ur: سعودی عرب

source: Solomon Islands
ur: سولومن آئلینڈز

source: Seychelles
ur: سشلیز

source: Sudan
ur: سوڈان

source: Sweden
ur: سویڈن

source: Singapore
ur: سنگاپور

source: St. Helena
ur: سینٹ ہیلینا

source: Slovenia
ur: سلووینیا

source: Svalbard & Jan Mayen
ur: سوالبرڈ اور جان ماین

source: Slovakia
ur: سلوواکیہ

source: Sierra Leone
ur: سیئر لیون

source: San Marino
ur: سان مارینو

source: Senegal
ur: سینیگل

source: Somalia
ur: صومالیہ

source: Suriname
ur: سورینام

source: South Sudan
ur: جنوبی سوڈان

source: São Tomé & Príncipe
ur: ساؤ ٹوم اور پرنسپے

source: El Salvador
ur: ال سلواڈور

source: Sint Maarten
ur: سنٹ مارٹن

source: Syria
ur: شام

source: Swaziland
ur: سوازی لینڈ

source: Tristan da Cunha
ur: ٹرسٹن ڈا کیونہا

source: Turks & Caicos Islands
ur: ترکس اور کیکاؤس جزائر

source: Chad
ur: چاڈ

source: French Southern Territories
ur: فرانسیسی جنوبی خطے

source: Togo
ur: ٹوگو

source: Thailand
ur: تھائی لینڈ

source: Tajikistan
ur: تاجکستان

source: Tokelau
ur: ٹوکیلاؤ

source: Timor-Leste
ur: تیمور لیسٹ

source: Turkmenistan
ur: ترکمانستان

source: Tunisia
ur: تیونیسیا

source: Tonga
ur: ٹونگا

source: Turkey
ur: ترکی

source: Trinidad & Tobago
ur: ترینیداد اور ٹوباگو

source: Tuvalu
ur: ٹووالو

source: Taiwan
ur: تائیوان

source: Tanzania
ur: تنزانیہ

source: Ukraine
ur: یوکرین

source: Uganda
ur: یوگانڈا

source: U.S. Outlying Islands
ur: امریکہ سے باہر کے چھوٹے جزائز

source: United States
ur: ریاستہائے متحدہ

source: Uruguay
ur: یوروگوئے

source: Uzbekistan
ur: ازبکستان

source: Vatican City
ur: واٹیکن سٹی

source: St. Vincent & Grenadines
ur: سینٹ ونسنٹ اور گرینیڈائنز

source: Venezuela
ur: وینزوئیلا

source: British Virgin Islands
ur: برٹش ورجن آئلینڈز

source: U.S. Virgin Islands
ur: امریکی ورجن آئلینڈز

source: Vietnam
ur: ویتنام

source: Vanuatu
ur: وینوآٹو

source: Wallis & Futuna
ur: ویلیز اور فیوٹیونا

source: Samoa
ur: ساموآ

source: Kosovo
ur: کوسووو

source: Yemen
ur: یمن

source: Mayotte
ur: مایوٹ

source: South Africa
ur: جنوبی افریقہ

source: Zambia
ur: زامبیا

source: Zimbabwe
ur: زمبابوے

source: Unknown Region
ur: نامعلوم علاقہ

source: Abidjan
ur: عابدجان

source: Accra
ur: اکّرا

source: Addis Ababa
ur: عدیس ابابا

source: Algiers
ur: الجیئرس

source: Asmara
ur: اسمارا

source: Bamako
ur: بماکو

source: Bangui
ur: بنگوئی

source: Banjul
ur: بنجول

source: Bissau
ur: بِساؤ

source: Blantyre
ur: بلینٹائر

source: Brazzaville
ur: برازاویلے

source: Bujumbura
ur: بجمبرا

source: Cairo
ur: قاہرہ

source: Casablanca
ur: کیسا بلانکا

source: Ceuta
ur: سیوٹا

source: Conakry
ur: کونکری

source: Dakar
ur: ڈکار

source: Dar es Salaam
ur: دار السلام

source: Douala
ur: ڈوآلا

source: El Aaiun
ur: العیون

source: Freetown
ur: فری ٹاؤن

source: Gaborone
ur: گبرون

source: Harare
ur: ہرارے

source: Johannesburg
ur: جوہانسبرگ

source: Juba
ur: جوبا

source: Kampala
ur: کیمپالا

source: Khartoum
ur: خرطوم

source: Kigali
ur: کگالی

source: Kinshasa
ur: کنشاسا

source: Lagos
ur: لاگوس

source: Libreville
ur: لبرے ویلے

source: Lome
ur: لوم

source: Luanda
ur: لوانڈا

source: Lubumbashi
ur: لوبمباشی

source: Lusaka
ur: لیوساکا

source: Malabo
ur: ملابو

source: Maputo
ur: مپوٹو

source: Maseru
ur: مسیرو

source: Mbabane
ur: مبابین

source: Mogadishu
ur: موگادیشو

source: Monrovia
ur: مونروویا

source: Nairobi
ur: نیروبی

source: Ndjamena
ur: اینجامینا

source: Niamey
ur: نیامی

source: Nouakchott
ur: نواکشوط

source: Ouagadougou
ur: اؤگاڈؤگوو

source: Porto-Novo
ur: پورٹو نووو

source: São Tomé
ur: ساؤ ٹوم

source: Tripoli
ur: ٹریپولی

source: Tunis
ur: تیونس

source: Windhoek
ur: ونڈہوک

source: Adak
ur: اداک

source: Anchorage
ur: اینکریج

source: Antigua
ur: انٹیگوا

source: Araguaina
ur: اراگویانا

source: La Rioja
ur: لا ریئوجا

source: Rio Gallegos
ur: ریو گالیگوس

source: Salta
ur: سالٹا

source: San Juan
ur: سان جوآن

source: San Luis
ur: سان لوئس

source: Tucuman
ur: ٹوکومین

source: Ushuaia
ur: اوشوآئیا

source: Asunción
ur: اسنسیئن

source: Bahia
ur: باہیا

source: Bahia Banderas
ur: بہیا بندراز

source: Belem
ur: بیلیم

source: Blanc-Sablon
ur: بلانک سبلون

source: Boa Vista
ur: بوآ وسٹا

source: Bogota
ur: بگوٹا

source: Boise
ur: بوائس

source: Buenos Aires
ur: بیونس آئرس

source: Cambridge Bay
ur: کیمبرج کی کھاڑی

source: Campo Grande
ur: کیمپو گرینڈ

source: Cancun
ur: کنکیون

source: Caracas
ur: کراکاس

source: Catamarca
ur: کیٹامارکا

source: Cayenne
ur: کائین

source: Cayman
ur: کیمین

source: Chicago
ur: شکاگو

source: Chihuahua
ur: چیہوآہوآ

source: Atikokan
ur: اٹیکوکن

source: Cordoba
ur: کورڈوبا

source: Creston
ur: کریسٹون

source: Cuiaba
ur: کوئیابا

source: Danmarkshavn
ur: ڈنمارک شاون

source: Dawson
ur: ڈاؤسن

source: Dawson Creek
ur: ڈاؤسن کریک

source: Denver
ur: ڈینور

source: Detroit
ur: ڈیٹرائٹ

source: Edmonton
ur: ایڈمونٹن

source: Eirunepe
ur: ایرونیپ

source: Fortaleza
ur: فورٹالیزا

source: Glace Bay
ur: گلیس کی کھاڑی

source: Nuuk
ur: نوک

source: Goose Bay
ur: گوس کی کھاڑی

source: Grand Turk
ur: عظیم ترک

source: Guayaquil
ur: گوآیاکوئل

source: Halifax
ur: ہیلیفیکس

source: Havana
ur: ہوانا

source: Hermosillo
ur: ہرموسیلو

source: Knox, Indiana
ur: کنوکس، انڈیانا

source: Marengo, Indiana
ur: مرینگو، انڈیانا

source: Petersburg, Indiana
ur: پیٹرزبرگ، انڈیانا

source: Tell City, Indiana
ur: ٹیل سٹی، انڈیانا

source: Vevay, Indiana
ur: ویوے، انڈیانا

source: Vincennes, Indiana
ur: ونسینیز، انڈیانا

source: Winamac, Indiana
ur: وینامیک، انڈیانا

source: Indianapolis
ur: انڈیاناپولس

source: Inuvik
ur: انووِک

source: Iqaluit
ur: ایکالوئٹ

source: Jujuy
ur: جوجوئی

source: Juneau
ur: جونیئو

source: Monticello, Kentucky
ur: مونٹیسیلو، کینٹوکی

source: Kralendijk
ur: کرالینڈیجک

source: La Paz
ur: لا پاز

source: Lima
ur: لیما

source: Los Angeles
ur: لاس اینجلس

source: Louisville
ur: لوئس ویلے

source: Lower Prince’s Quarter
ur: لوور پرنسس کوارٹر

source: Maceio
ur: میسیئو

source: Managua
ur: مناگوآ

source: Manaus
ur: مناؤس

source: Marigot
ur: میریگوٹ

source: Matamoros
ur: میٹاموروس

source: Mazatlan
ur: میزٹلان

source: Mendoza
ur: مینڈوزا

source: Menominee
ur: مینومینی

source: Merida
ur: میریڈا

source: Metlakatla
ur: میٹلا کاٹلا

source: Mexico City
ur: میکسیکو سٹی

source: Miquelon
ur: میکلیئون

source: Moncton
ur: مونکٹن

source: Monterrey
ur: مونٹیری

source: Montevideo
ur: مونٹی ویڈیو

source: Nassau
ur: نساؤ

source: New York
ur: نیو یارک

source: Nipigon
ur: نپیگون

source: Nome
ur: نوم

source: Noronha
ur: نورونہا

source: Beulah, North Dakota
ur: بیولاہ، شمالی ڈکوٹا

source: Center, North Dakota
ur: وسط، شمالی ڈکوٹا

source: New Salem, North Dakota
ur: نیو سلیم، شمالی ڈکوٹا

source: Ojinaga
ur: اوجیناگا

source: Pangnirtung
ur: پینگنِرٹنگ

source: Paramaribo
ur: پراماریبو

source: Phoenix
ur: فینکس

source: Port-au-Prince
ur: پورٹ او پرنس

source: Port of Spain
ur: پورٹ آف اسپین

source: Porto Velho
ur: پورٹو ویلہو

source: Rainy River
ur: رینی ریور

source: Rankin Inlet
ur: رینکن انلیٹ

source: Recife
ur: ریسائف

source: Regina
ur: ریجینا

source: Resolute
ur: ریزولیوٹ

source: Rio Branco
ur: ریئو برینکو

source: Santarem
ur: سنٹارین

source: Santiago
ur: سنٹیاگو

source: Santo Domingo
ur: سانتو ڈومنگو

source: Sao Paulo
ur: ساؤ پالو

source: Ittoqqortoormiit
ur: اسکورز بائی سنڈ

source: Sitka
ur: سیٹکا

source: St. John’s
ur: سینٹ جانز

source: St. Kitts
ur: سینٹ کٹس

source: St. Thomas
ur: سینٹ تھامس

source: St. Vincent
ur: سینٹ ونسنٹ

source: Swift Current
ur: سوِفٹ کرنٹ

source: Tegucigalpa
ur: ٹیگوسیگالپے

source: Thule
ur: تھولو

source: Thunder Bay
ur: تھنڈر بے

source: Tijuana
ur: تیجوآنا

source: Toronto
ur: ٹورنٹو

source: Tortola
ur: ٹورٹولا

source: Vancouver
ur: وینکوور

source: Whitehorse
ur: وہائٹ ہارس

source: Winnipeg
ur: ونّیپیگ

source: Yakutat
ur: یکوٹیٹ

source: Yellowknife
ur: ایلو نائف

source: Casey
ur: کیسی

source: Davis
ur: ڈیوس

source: Dumont d’Urville
ur: ڈومونٹ ڈی ارویلے

source: Macquarie
ur: میکواری

source: Mawson
ur: ماؤسن

source: McMurdo
ur: میک مرڈو

source: Palmer
ur: پلمیر

source: Rothera
ur: روتھیرا

source: Syowa
ur: سیووا

source: Troll
ur: ٹرول

source: Vostok
ur: ووستوک

source: Longyearbyen
ur: لانگ ایئر بین

source: Aden
ur: عدن

source: Almaty
ur: الماٹی

source: Amman
ur: امّان

source: Anadyr
ur: انیدر

source: Aqtau
ur: اکتاؤ

source: Aqtobe
ur: اکٹوب

source: Ashgabat
ur: اشغبت

source: Baghdad
ur: بغداد

source: Baku
ur: باکو

source: Bangkok
ur: بنکاک

source: Beirut
ur: بیروت

source: Bishkek
ur: بشکیک

source: Kolkata
ur: کولکاتا

source: Chita
ur: چیتا

source: Choibalsan
ur: چوئبالسان

source: Colombo
ur: کولمبو

source: Damascus
ur: دمشق

source: Dhaka
ur: ڈھاکہ

source: Dili
ur: ڈلی

source: Dubai
ur: دوبئی

source: Dushanbe
ur: دوشانبے

source: Gaza
ur: غزہ

source: Hebron
ur: ہیبرون

source: Hovd
ur: ہووارڈ

source: Irkutsk
ur: ارکتسک

source: Jakarta
ur: جکارتہ

source: Jayapura
ur: جے پورہ

source: Jerusalem
ur: یروشلم

source: Kabul
ur: کابل

source: Kamchatka
ur: کیمچٹکا

source: Karachi
ur: کراچی

source: Kathmandu
ur: کاٹھمنڈو

source: Khandyga
ur: خندیگا

source: Krasnoyarsk
ur: کریسنویارسک

source: Kuala Lumpur
ur: کوالا لمپور

source: Kuching
ur: کیوچنگ

source: Magadan
ur: میگیدن

source: Makassar
ur: مکاسر

source: Manila
ur: منیلا

source: Muscat
ur: مسقط

source: Nicosia
ur: نکوسیا

source: Novokuznetsk
ur: نوووکیوزنیسک

source: Novosibirsk
ur: نوووسِبِرسک

source: Omsk
ur: اومسک

source: Oral
ur: اورال

source: Phnom Penh
ur: پنوم پن

source: Pontianak
ur: پونٹیانک

source: Pyongyang
ur: پیونگ یانگ

source: Qyzylorda
ur: کیزیلورڈا

source: Rangoon
ur: رنگون

source: Riyadh
ur: ریاض

source: Ho Chi Minh City
ur: ہو چی منہ سٹی

source: Sakhalin
ur: سخالین

source: Samarkand
ur: سمرقند

source: Seoul
ur: سیئول

source: Shanghai
ur: شنگھائی

source: Srednekolymsk
ur: سرہدنیکولیمسک

source: Taipei
ur: تائپے

source: Tashkent
ur: تاشقند

source: Tbilisi
ur: طبلیسی

source: Tehran
ur: تہران

source: Thimphu
ur: تھمپو

source: Tokyo
ur: ٹوکیو

source: Ulaanbaatar
ur: اولان باتار

source: Urumqi
ur: یورومکی

source: Vientiane
ur: وینٹیانا

source: Vladivostok
ur: ولادی ووستک

source: Yakutsk
ur: یکوتسک

source: Yekaterinburg
ur: یکاٹیرِنبرگ

source: Yerevan
ur: یریوان

source: Azores
ur: ازوریس

source: Canary
ur: کینری

source: Faroe
ur: فارو

source: Madeira
ur: مڈیئرا

source: Reykjavik
ur: ریکجاوک

source: South Georgia
ur: جنوبی جارجیا

source: Stanley
ur: اسٹینلے

source: Adelaide
ur: اڈیلائڈ

source: Brisbane
ur: برسبین

source: Broken Hill
ur: بروکن ہِل

source: Currie
ur: کیوری

source: Darwin
ur: ڈارون

source: Eucla
ur: ایوکلا

source: Hobart
ur: ہوبارٹ

source: Lindeman
ur: لِنڈمین

source: Lord Howe
ur: لارڈ ہووے

source: Melbourne
ur: ملبورن

source: Perth
ur: پرتھ

source: Sydney
ur: سڈنی

source: Unknown City
ur: نامعلوم شہر

source: Amsterdam
ur: ایمسٹرڈم

source: Athens
ur: ایتھنز

source: Belgrade
ur: بلغراد

source: Berlin
ur: برلن

source: Bratislava
ur: بریٹِسلاوا

source: Brussels
ur: برسلز

source: Bucharest
ur: بخارسٹ

source: Budapest
ur: بڈاپسٹ

source: Busingen
ur: بزنجن

source: Chisinau
ur: چیسیناؤ

source: Copenhagen
ur: کوپن ہیگن

source: Dublin
ur: ڈبلن

source: Helsinki
ur: ہیلسنکی

source: Istanbul
ur: استنبول

source: Kaliningrad
ur: كالينينغراد

source: Kiev
ur: کیوو

source: Lisbon
ur: لسبن

source: Ljubljana
ur: لیوبلیانا

source: London
ur: لندن

source: Madrid
ur: میڈرڈ

source: Mariehamn
ur: میریہام

source: Minsk
ur: مِنسک

source: Moscow
ur: ماسکو

source: Oslo
ur: اوسلو

source: Paris
ur: پیرس

source: Podgorica
ur: پوڈگورسیا

source: Prague
ur: پراگ

source: Riga
ur: ریگا

source: Rome
ur: روم

source: Samara
ur: سمارا

source: Sarajevo
ur: سراجیوو

source: Simferopol
ur: سمفروپول

source: Skopje
ur: اسکوپجے

source: Sofia
ur: صوفیہ

source: Stockholm
ur: اسٹاک ہوم

source: Tallinn
ur: ٹالن

source: Tirane
ur: ٹیرانی

source: Uzhhorod
ur: ازگوروڈ

source: Vaduz
ur: ویڈوز

source: Vatican
ur: واٹیکن

source: Vienna
ur: ویانا

source: Vilnius
ur: وِلنیئس

source: Volgograd
ur: وولگوگراد

source: Warsaw
ur: وارسا

source: Zagreb
ur: زیگریب

source: Zaporozhye
ur: زیپوروزائی

source: Zurich
ur: زیورخ

source: Antananarivo
ur: انٹاناناریوو

source: Chagos
ur: چاگوس

source: Christmas
ur: کرسمس

source: Cocos
ur: کوکوس

source: Comoro
ur: کومورو

source: Kerguelen
ur: کرگیولین

source: Mahe
ur: ماہی

source: Apia
ur: اپیا

source: Auckland
ur: آکلینڈ

source: Bougainville
ur: بوگینولے

source: Chatham
ur: چیتھم

source: Easter
ur: ایسٹر

source: Efate
ur: ایفیٹ

source: Enderbury
ur: اینڈربری

source: Fakaofo
ur: فکاؤفو

source: Funafuti
ur: فیونافیوٹی

source: Galapagos
ur: گیلاپیگوس

source: Gambier
ur: گامبیئر

source: Guadalcanal
ur: گواڈل کینال

source: Honolulu
ur: ہونولولو

source: Johnston
ur: جانسٹن

source: Kiritimati
ur: کریتیماٹی

source: Kosrae
ur: کوسرائی

source: Kwajalein
ur: کواجیلین

source: Majuro
ur: مجورو

source: Marquesas
ur: مارکیساس

source: Midway
ur: مڈوے

source: Norfolk
ur: نورفوک

source: Noumea
ur: نؤمیا

source: Pago Pago
ur: پاگو پاگو

source: Pitcairn
ur: پٹکائرن

source: Pohnpei
ur: پونپیئی

source: Port Moresby
ur: پورٹ موریسبی

source: Rarotonga
ur: راروٹونگا

source: Saipan
ur: سائپین

source: Tahiti
ur: تاہیتی

source: Tarawa
ur: ٹراوا

source: Tongatapu
ur: ٹونگاٹاپو

source: Chuuk
ur: چیوک

source: Wake
ur: ویک

source: Wallis
ur: ولّیس

source: Afghanistan Time
ur: افغانستان کا وقت

source: Central Africa Time
ur: وسطی افریقہ ٹائم

source: East Africa Time
ur: مشرقی افریقہ ٹائم

source: South Africa Standard Time
ur: جنوبی افریقہ سٹینڈرڈ ٹائم

source: West Africa Time
ur: مغربی افریقہ ٹائم

source: Alaska Time
ur: الاسکا ٹائم

source: Amazon Time
ur: امیزون ٹائم

source: Central Time
ur: سنٹرل ٹائم

source: Eastern Time
ur: ایسٹرن ٹائم

source: Mountain Time
ur: ماؤنٹین ٹائم

source: Pacific Time
ur: پیسفک ٹائم

source: Anadyr Time
ur: انیدر ٹائم

source: Apia Time
ur: ایپیا ٹائم

source: Arabian Time
ur: عرب کا وقت

source: Argentina Time
ur: ارجنٹینا ٹائم

source: Western Argentina Time
ur: مغربی ارجنٹینا کا وقت

source: Armenia Time
ur: آرمینیا کا وقت

source: Atlantic Time
ur: اٹلانٹک ٹائم

source: Central Australia Time
ur: سنٹرل آسٹریلیا ٹائم

source: Australian Central Western Time
ur: آسٹریلین سنٹرل ویسٹرن ٹائم

source: Eastern Australia Time
ur: ایسٹرن آسٹریلیا ٹائم

source: Western Australia Time
ur: ویسٹرن آسٹریلیا ٹائم

source: Azerbaijan Time
ur: آذربائیجان کا وقت

source: Azores Time
ur: ازوریس کا وقت

source: Bangladesh Time
ur: بنگلہ دیش کا وقت

source: Bhutan Time
ur: بھوٹان کا وقت

source: Bolivia Time
ur: بولیویا کا وقت

source: Brasilia Time
ur: برازیلیا ٹائم

source: Brunei Darussalam Time
ur: برونئی دارالسلام ٹائم

source: Cape Verde Time
ur: کیپ ورڈی ٹائم

source: Chamorro Standard Time
ur: چامورو سٹینڈرڈ ٹائم

source: Chatham Time
ur: چیتھم ٹائم

source: Chile Time
ur: چلی کا وقت

source: China Time
ur: چین ٹائم

source: Choibalsan Time
ur: کوئبلسان ٹائم

source: Christmas Island Time
ur: کرسمس آئلینڈ ٹائم

source: Cocos Islands Time
ur: کوکوس آئلینڈز ٹائم

source: Colombia Time
ur: کولمبیا ٹائم

source: Cook Islands Time
ur: کک آئلینڈز ٹائم

source: Cuba Time
ur: کیوبا ٹائم

source: Davis Time
ur: ڈیوس ٹائم

source: Dumont-d’Urville Time
ur: ڈومونٹ-ڈی’ارویلے ٹائم

source: East Timor Time
ur: مشرقی تیمور ٹائم

source: Easter Island Time
ur: ایسٹر آئلینڈ کا وقت

source: Ecuador Time
ur: ایکواڈور کا وقت

source: Central European Time
ur: وسط یورپ کا وقت

source: Eastern European Time
ur: مشرقی یورپ کا وقت

source: Further-eastern European Time
ur: بعید مشرقی یورپی وقت

source: Western European Time
ur: مغربی یورپ کا وقت

source: Falkland Islands Time
ur: فاک لینڈ آئلینڈز کا وقت

source: Fiji Time
ur: فجی ٹائم

source: French Guiana Time
ur: فرینچ گیانا کا وقت

source: French Southern & Antarctic Time
ur: فرینچ جنوبی اور انٹارکٹک ٹائم

source: Greenwich Mean Time
ur: گرین وچ کا اصل وقت

source: Galapagos Time
ur: گالاپاگوز کا وقت

source: Gambier Time
ur: گیمبیئر ٹائم

source: Georgia Time
ur: جارجیا کا وقت

source: Gilbert Islands Time
ur: جلبرٹ آئلینڈز ٹائم

source: East Greenland Time
ur: مشرقی گرین لینڈ ٹائم

source: West Greenland Time
ur: مغربی گرین لینڈ ٹائم
