Repository: pypi-data/pypi-mirror-19
Catalog: packages/rapid-router/rapid_router-1.0.0.post0.dev330-py2.py3-none-any.whl/game/locale/*/LC_MESSAGES/django.po
Languages: pl_pl

source: Notice the snow! You can create new levels with different 'themes' of backgrounds and decorations in the Level Editor. But first, try getting the van to the house!
pl_pl: Popatrz, to śnieg! W edytorze poziomów możesz tworzyć własne poziomy z różnymi rodzajami tła i dodatkami. Zanim to sprawdzisz, zaprowadź samochód do domu!

source: Break the program into two <b>Repeat</b>s with a <b>Turn left</b> in between them.
pl_pl: Podziel program na dwie pętle (bloczek <b>Repeat</b>) oddzielone poleceniem "skręć w lewo" (bloczek <b>Turn left</b>).

source: Farmyard
pl_pl: Na farmie

source: What a muddy road! Can you help Dee find her way from the barn to the house?
pl_pl: Ale błotnista droga! Czy potrafisz pomóc Dee znaleźć drogę ze stodoły do domu?

source: Make sure you drag the correct turns into your <b>Repeat</b> block.
pl_pl: Upewnij się, że wewnątrz pętli (bloczek <b>Repeat</b>) używasz skrętów w prawidłową stronę.

source: The big city
pl_pl: W wielkim mieście

source: Can you get the van from the warehouse to the house? Don't stop at any shops on the way!
pl_pl: Poprowadź kierowcę prosto do domu. Nie zatrzymuj się w żadnym ze sklepów mijanych po drodze!

source: Make sure you drag the correct turns into your <b>Repeat</b> block.
pl_pl: Upewnij się, że wewnątrz pętli (bloczek <b>Repeat</b>) używasz skrętów w prawidłową stronę.

source: No need for numbers.
pl_pl: Spróbujmy bez liczb

source: Drag a block inside a <b>Repeat until</b> block to make the van repeat an instruction. <br> Attach a 'condition' so the van knows when to stop repeating the instruction. <br> Here, you want the van to repeat your instruction until it is at the destination. <br> Doing this means you don't have to work out how many times the van should repeat your instruction.
pl_pl: Umieść bloczek z poleceniem wewnątrz bloczka <b>Repeat until</b> ("powtarzaj aż"), a samochód powtórzy to polecenie. Podepnij bloczek z 'warunkiem', aby samochód wiedział, kiedy ma przerwać powtarzanie. <br><br>Na tym poziomie samochód powinien powtarzać polecenie, dopóki nie dotrze do celu (bloczek <b>at destination</b>). <br><br> Dzięki temu nie musisz zastanawiać się, ile razy samochód powinien powtórzyć Twoje polecenie.

source: The blocks should read like a sentence: '<b>Repeat <b>until</b> <b>at destination do: Move forwards</b>'.
pl_pl: Bloczki powinny ułożyć się w zdanie (w jęz. ang.) ''<b>Repeat <b>until</b> <b>at destination do: Move forwards</b>".

source: Can you do that again?
pl_pl: Czy możesz to powtórzyć?

source: Well done, you did it! Now have a go at using the <b>Repeat until<b> block on a road with lots of turns.
pl_pl: Świetna robota! Teraz czas użyć pętli "powtarzaj aż" (bloczek <b>Repeat until</b>) na drodze pełnej zakrętów.

source: The blocks should read like a sentence: '<b>Repeat until at destination</b> <b>do</b>: <b>Turn left</b>, <b>Turn right</b>'.
pl_pl: Bloczki powinny ułożyć się w zdanie (w jęz. ang.): "<b>Repeat until at destination</b> <b>do</b>: <b>Turn left</b>, <b>Turn right</b>".

source: Practice makes perfect.
pl_pl: Praktyka czyni mistrza

source: Have another go to make sure you have got the hang of it.
pl_pl: Jeszcze jedna trasa, aby przećwiczyć użycie pętli "powtarzaj aż" (bloczek <b>Repeat until</b>).

source: This program can be broken into repeated sets of <b>Turn left</b>, <b>Turn right</b> and two <b>Move forwards</b>.
pl_pl: Ten poziom można ukończyć powtarzając zestaw poleceń: "skręć w lewo" (bloczek <b>Turn left</b>), "skręć w prawo" (bloczek <b>Turn right</b>) i dwa razy "jedź prosto" (bloczek <b>Move forwards</b>).

source: Uh oh, it's <b>Until</b> fever!
pl_pl: Szaleństwo powtarzania!

source: Good job! Can you help the driver reach the destination again?
pl_pl: Dobra robota! Pomóż kierowcy ponownie dotrzeć do celu.

source: This program is quite similar to the one you just solved. Do you remember the solution you came up with back then?
pl_pl: Ten program jest bardzo podobny do poprzedniego. Czy pamiętasz tamto rozwiązanie?

source: Now it's time to try the <b>If</b> block.
pl_pl: Czas spróbować bloczka <b>Jeżeli</b>

source: Another way of telling the van what to do is to use the <b>If</b> block. For example, <b>If</b> the <b>road exists forwards do</b> <b>Move forwards</b>. <br> This is called an 'if statement'. <br> Try using the <b>If</b> block and the <b>Repeat</b> block together. <br> The <b>Repeat</b> block will stretch if you attach the <b>If</b> block inside it.
pl_pl: Kolejnym sposobem na sterowanie samochodem jest użycie bloczka <b>Jeżeli</b>. Na przykład <b>Jeżeli</b> <b>droga prowadzi prosto</b> to <b>Jedź prosto</b>. Nazywamy to instrukcją warunkową "jeżeli".<br><br> Spróbuj użyć bloczków <b>Jeżeli</b> oraz <b>Powtarzaj</b> razem. Bloczek <b>Powtarzaj</b> rozciągnie się, kiedy podepniesz do niego bloczek <b>Jeżeli</b>.

source: Multiple <b>If</b>s
pl_pl: Podejmowanie decyzji

source: It can be handy to use <b>If</b> to give your van choices, so you don't have to give the van new instructions at every step. <br> For example: Tell the van <b>If</b> the <b>road exists forwards do Move forwards,</b> but <b>If</b> the <b>road exists left do Turn left</b>. <br> The van will choose correctly from the <b>Move forwards</b> and <b>Turn left</b> instructions depending on the road. <br> Use an 'if statement' in a 'loop' to drive the van down this bendy road.
pl_pl: Dzięki instrukcji warunkowej "jeżeli" (bloczek <b>If</b>) możnesz sprawić, że samochód będzie samodzielnie podejmować decyzje, zamiast czekać na instrukcje krok po kroku. <br>Na przykład: jedź do przodu <b>jeżeli</b> <b>droga znajduje się z przodu</b>, ale <b>jeżeli</b> <b>droga znajduje się z lewej strony</b> to <b>skręć w lewo</b>. Samochód sam wybierze właściwą instrukcję spośród <b>jedź do przodu</b> i <b>skręć w lewo</b>, w zależności od tego jak wygląda droga przed nim.<br><br> Użyj instrukcji <b>jeżeli</b> (bloczek <b>If</b>) wewnątrz pętli i pokonaj tę krętą drogę.

source: At each bend the van can either <b>Move forwards</b> or <b>Turn left</b>. Create a loop so it can make the correct choice. <br><br> We say that the road 'exists' in a direction. For example, if the road goes forwards we say that it 'exists forwards'.
pl_pl: Na każdym łuku drogi samochód może albo <b>jechać prosto</b> (bloczek <b>Move forwards</b>) albo <b>skręcić w lewo</b> (bloczek <b>Turn left</b>). Zbuduj pętlę, aby sam mógł decydować o swoim ruchu.

source: Let's put it all together!
pl_pl: Połączmy wszystko razem!

source: You have discovered the magic of 'if statements'. Can you make a program that uses <b>Move forwards</b>, <b>Turn left</b> and <b>Turn right</b> to get the van to the house.
pl_pl: Poznałeś właśnie magiczną moc instrukcji "jeżeli". Czy potrafisz ułożyć program, który zaprowadzi samochód do domu, używając instrukcji <b>jeżeli</b> (bloczek <b>If</b>), <b>skręć w lewo</b> (bloczek <b>Turn left</b>) i <b>skręć w prawo</b> (bloczek <b>Turn right</b>)?

source: What else? If-else, that's what!
pl_pl: A jeżeli nie, to co?

source: You can change the <b>If</b> block to make more choices. Click on the star in the <b>If</b> block and add <b>Else if</b>. <br> This will tell the van what to do if the first <b>If</b> direction can't be done. <br> For example, tell the van to <b>Turn left</b> <b>If</b> the <b>road exists left</b>. Add <b>Else if</b> the <b>road exists right</b>, <b>Turn right</b>. <br> This uses fewer blocks and makes sure that only one step is taken in each loop. <br> This type of algorithm is called a 'general algorithm' as it can be used with most simple routes.
pl_pl: Czy wiesz, że w jednym bloczku <b>jeżeli</b> (bloczek <b>If</b>) możesz wprowadzić kilka opcji do wyboru? Kliknij na znaku "plus" znajdującym się wewnątrz bloczka i dodaj <b>w przeciwnym razie, jeżeli</b> (instrukcja <b>Else if</b>). W ten sposób samochód dowie się, co zrobić kiedy pierwsza z instrukcji <b>jeżeli</b> nie będzie mogła być wykonana. <br><br> Na przykład: <b>skręć w lewo jeżeli droga znajduje się po lewej stronie</b>. Dodaj <b>w przeciwnym razie, jeżeli droga znajduje się z prawej strony</b> to <b>skręć w prawo</b>. <br>Ten sposób wymaga użycia mniejszej liczby bloczków i zapewnia, że w każdej pętli samochód wykona dokładnie jedno polecenie. <br><br> Taki rodzaj algorytmy nazywa się "algorytmem ogólnym", ponieważ może być z powodzeniem używany na większości prostych tras.

source: A bit longer.
pl_pl: Trochę dalej

source: Let's see if we can go further - this road is longer. Notice that the length of the road does not change the length of your program!
pl_pl: Ta droga jest dłuższa - sprawdźmy, czy dasz radę dojechać dalej. Zauważ, że długość drogi nie ma wpływu na długość Twojego programu!

source: Think back to the solutions you produced using 'if statements' before.
pl_pl: Przypomnij sobie programy z instrukcją "jeżeli", które napisałeś do tej pory.

source: Third time lucky!
pl_pl: Do trzech razy sztuka!

source: Well done! You've got so far. <br> Can you apply the knowledge you gained going through this part of the game to this level?
pl_pl: Dobra robota! Doszedłeś naprawdę daleko! <br> Czy potrafisz wykorzystać zdobytą dotychczas wiedzę, żeby pokonać ten poziom?

source: Dead ends!
pl_pl: Uwaga na ślepe zaułki!

source: Can you change the 'general algorithm' so that the van takes a shorter route? <br> What if you change the order the van checks for directions? <br> Keep an eye on the fuel level - try to use as little as possible.
pl_pl: Czy potrafisz zmienić "ogólny algorytm" tak, aby samochód pojechał krótszą drogą? Co się stanie, jeżeli zmienimy kolejność w jakiej auto wybiera kierunek jazdy?<br><br> Nie zapomnij o sprawdzaniu poziomu paliwa - spróbuj zużyć go najmniej jak się da.

source: Make the van check if the road exists right before it checks if the road exists left. <br><br> Then it will be able to reach the destination using the 'general algorithm'. Can you see why?
pl_pl: Samochód powinien najpierw sprawdzić, czy droga znajduje się po prawej stronie (zanim sprawdzi czy jest ona po lewej). Wtedy będzie w stanie dojechać do celu korzystając z "ogólnego algorytmu". Czy wiesz już dlaczego?

source: Adjust your previous solution.
pl_pl: Dostosuj poprzednie rozwiązanie

source: Can you think of a way you could change the 'general algorithm' you have implemented earlier to make sure the van driver reaches the house having travelled the shortest route?
pl_pl: Czy potrafisz wymyślić taką zmianę w "ogólnym algorytmie", który napisałeś wcześniej, która sprawi, że kierowca dotrze do celu jadąc najkrótszą drogą?

source: The 'general algorithm' will work here. <br><br> Make sure you change the order the van checks for directions to take the shortest route to the destination.
pl_pl: "Ogólny algorytm" działa dobrze na tym poziomie. <br><br> Upewnij się, że zmieniłeś kolejność, w jakiej samochód wybiera kierunek jazdy, tak, żeby wybrał najkrótszą drogę do celu.

source: Decision time.
pl_pl: Czas na decyzję

source: Do you think changes to the 'general algorithm' will help the van find the shortest route? <br> Or do you have to come up with a different solution? <br> Time to make a decision...
pl_pl: Czy myślisz, że zmiany w "ogólnym algorytmie" pomogą kierowcy znaleźć najkrótszą drogę? Czy musisz jednak wymyślić inne rozwiązanie? <br><br> Czas podjąć tę decyzję...

source: Psst! You can simply make a change to the 'general algorithm'. <br><br> If you make the van check for turns before it checks the road exists forwards, you will come up with the perfect solution. <br><br>Notice that here it doesn't matter which turn you check for first - it will change the route but provide you with the same score.
pl_pl: Psssst! Możesz spokojnie zrobić zmianę w "ogólnym algorytmie". <br><br> Jeśli samochód sprawdzi najpierw, czy może skręcić w prawo lub lewo, a dopiero potem czy może jechać prosto, to będziesz mieć idealne rozwiązanie. <br><br> Zauważ, że nie ma znaczenia, który zakręt (w prawo czy w lewo) sprawdzisz najpierw - zmieni to co prawda trasę przejazdu samochodu, ale nie będzie miało wpływu na zdobyte punkty.

source: What do you think this time?
pl_pl: A co powiesz na to?

source: Can you use the 'general algorithm' here? <br> Can it be changed so that it finds a shorter route, or will you need a new solution?
pl_pl: Czy możesz użyć tutaj "ogólnego algorytmu"? <br> Czy można go zmienić, żeby znajdował najkrótszą drogę? Czy może potrzebne jest zupełnie nowe rozwiązanie?

source: Uh oh, moving around the blocks in your 'general algorithm' won't help. <br> How about creating a simple solution without 'if statements' that will help the van reach the house?
pl_pl: Ups, przesuwanie bloczków w Twoim "ogólnym algorytmie" nie pomoże tym razem. <br> A co powiesz na to, żeby ułożyć proste rozwiązanie, bez instrukcji "jeżeli", które poprowadzi samochód to celu?

source: Good work! What else can you do?
pl_pl: Dobra robota! Co jeszcze potrafisz?

source: You should be really good at this by now. Can you manage this complicated road?
pl_pl: Wygląda na to, że całkiem dobrze się już na tym znasz. Czy dasz radę pokonać tę skomplikowaną trasę?

source: This road cannot be solved by a 'general algorithm'. Can you solve it without 'if statements'? <br><br> Remember to choose the shortest route and an algorithm which is as short as possible.
pl_pl: Na tej drodze nie da się skorzystać z "ogólnego algorytmu". Czy potrafisz pokonać ją bez korzystania z instrukcji "jeżeli"? <br><br> Pamiętaj, żeby wybrać najkrótszą trasę i napisać program tak krótki, jak to tylko możliwe.

source: Oh no! Traffic lights!
pl_pl: O nie! Sygnalizacja świetlna!

source: The light varies from red to green. <br>The van must check which colour the traffic light is when it reaches them - if it goes past a red light it will break the Highway Code.<br> Here, you want the van to repeat the wait instruction while the traffic light is red. Drag a block inside a <b>Repeat while</b> block to make the van repeat an instruction. <br> Attach a 'condition' so the van knows when to repeat the instruction.
pl_pl: Światło zmienia kolor z czerwonego na zielony. Po zbliżeniu się do świateł van musi sprawdzić jakiego koloru światło świeci. Gdyby przejechał na czerwonym, złamałby przepisy ruchu drogowego.<br>Chcemy, aby samochód powtarzał instrukcję czekania tak długo, jak długo świeci się czerwone światło.<br><br> Umieść bloczek z instrukcją <b>czekaj</b> wewnątrz bloczka <b>powtarzaj gdy</b>. Następnie dołącz odpowiedni warunek, żeby samochód wiedział, kiedy ma powtarzać polecenie.

source: Don't worry about the 'general algorithm' here. Just go forwards. <br><br>Once the van is right under the traffic light, make it wait for a green light by adding a <b>Wait</b> block.
pl_pl: Nie przejmuj się tutaj "ogólnym algorytmem". Po prostu jedź naprzód. <br><br>Kiedy samochód znajduje się przy światłach, każ mu czekać na zielone światło używają bloczka <b>czekaj</b>.

source: Green for go, red for wait.
pl_pl: Zielony - jedź, czerwony - stój

source: Can you write a program so the van moves forwards on a green light but waits at a red light?
pl_pl: Potrafisz napisać program tak, by na zielonym świetle samochód jechał, a na czerwonym czekał?

source: Use an 'if statement' to tell the van <b>If traffic light is red, Wait, Else Move forwards</b>. <br><br> Remember to repeat that until you get to the destination.
pl_pl: Użyj instrukcji <b>jeżeli</b> aby powiedzieć samochodowi "Jeżeli jest czerwone światło - czekaj, w przeciwnym razie - jedź naprzód".<br><br>Pamiętaj, aby powtarzać te instrukcje, aż dotrze do celu.

source: Well done - you've made it really far!
pl_pl: Dobra robota - doszedłeś naprawdę daleko!

source: Let's practise what you've learnt so far. <br> Don't forget to add a turn and to make the van wait at a traffic light.
pl_pl: Poćwiczmy to, czego się do tej pory nauczyłeś. <br>Nie zapomnij o zakrętach ani o tym, żeby zaczekać na światłach.

source: Be careful about the order you put your <b>If</b> blocks in. <br><br>If you make the van check the road exists forwards before checking for a light, it might break the Highway Code.
pl_pl: Uważaj na kolejność, w jakiej układasz bloczki <b>jeżeli</b>. <br><br>Jeżeli samochód najpierw sprawdzi, czy ma przed sobą drogę, a dopiero potem kolor światła, to może złamać przepisy ruchu drogowego.

source: What a mess! But can you spot a route?
pl_pl: Co za bałagan! Ale czy mimo to potrafisz dostrzec trasę?

source: Put your knowledge to test. Create an algorithm to lead the van to the house. <br> Don't forget to add a turn and to make the van wait at a traffic light.
pl_pl: Przetestujmy Twoją wiedzę. Stwórz algorytm by doprowadzić samochód do domu. <br> Nie zapomnij o zakręcie i o tym by zatrzymać się na światłach.

source: Put all that hard work to the test.
pl_pl: Wykorzystaj to czego się nauczyłeś, by wykonać to zadanie.

source: Congratulations - you've made it really far! <br> Can you create a 'general algorithm' that will help the van reach the destination in the shortest way but stop at a traffic light?
pl_pl: Gratulacje - zaszedłeś już naprawdę daleko!<br>Potrafisz stworzyć 'ogólny algorytm', który pozwoli vanowi dotrzeć do celu najkrótszą drogą, pamiętając, żeby zatrzymywał się na światłach komunikacyjnych?

source: You need to check: <li> if the lights are red </li><li> if the road exists right </li><li> if the road exists forwards </li> <li> if the road exists left </li><li> if it is a dead end </li>Make sure you put the checks in the right order.
pl_pl: Musisz sprawdzić:<li> czy świtała są czerwone </li><li> czy istnieje droga w prawo </li><li>czy istnieje droga naprzód </li><li> czy istnieje droga w lewo </li><li> czy to jest ślepy zaułek</li>Upewnij się, czy sprawdzasz warunki w odpowiedniej kolejności.

source: Amazing! Have another go!
pl_pl: Wspaniale! Spróbuj jeszcze raz!

source: Can you change the 'general algorithm' you created before to make the van take the shortest route to the destination?
pl_pl: Potrafisz tak zmienić "algorytm ogólny", który stworzyłeś wcześniej, by wan wybierał najkrótszą drogę do celu?

source: You need to check: <li> if the light is red </li><li> if the road exists left </li><li> if the road exists forwards </li><li> or if the road exists right </li>Do you think you need to check for a dead end? <br> Make sure you put the checks in the right order.
pl_pl: Musisz sprawdzić:<li> czy światła są czerwone </li><li> czy istnieje droga w lewo </li><li> czy istnieje droga naprzód </li><li> czy istnieje droga w prawo </li> Czy uważasz, że powinieneś sprawdzać czy to jest ślepy zaułek? <br> Upewnij się czy warunki są sprawdzane w odpowiedniej kolejności.

source: Light maze.
pl_pl: Sygnalizacyjny labirynt.

source: Well this is tricky. Look at all those lights! <br> Can you find the shortest route to the destination? It would be good if the van doesn't have to wait at too many lights.
pl_pl: To nie takie proste. Spójrz na te wszystkie światła! <br> Potrafisz znaleźć najkrótszą trasę do celu? Byłoby dobrze, gdyby wan nie musiał czekać na zbyt wielu światłach.

source: Don't worry about the algorithm you've already come up with. Take the first turn left which has fewer traffic lights. <br><br> Once your van is right under the traffic lights, make sure it waits for a green light.
pl_pl: Nie zawracaj sobie głowy algorytmem, który niedawno stworzyłeś. Skręć w lewo przy pierwszym zakręcie, który posiada mniej świateł. <br><br> Kiedy wan znajdzie się przy światłach, upewnij się, że poczeka na zielone.

source: Back to basics with a twist
pl_pl: Powrót do podstaw z niespodzianką

source: Can you come up with a solution to this level using the limited number of blocks we provide at the start?
pl_pl: Potrafisz wymyślić rozwiązanie do tego poziomu zaczynając z ograniczoną liczbą bloczków?

source: Think back to earlier levels - what did you learn?
pl_pl: Przypomnij sobie poprzednie poziomy - czego się nauczyłeś?

source: A Bit more Tricky
pl_pl: Trochę trudniejsze

source: Well done so far! Can you find a solution to this road? You have to move forward, but you have no forward block to use. Do you know how to help the van get to the destination?
pl_pl: Dobra robota! Potrafisz znaleźć rozwiązanie dla tej trasy? Musisz ruszać się naprzód, jednak nie posiadasz żadnych bloczków tego typu. Wiesz, jak pomóc ciężarówce dotrzeć do celu?

source: Don't forget to use the repeat loop.
pl_pl: Nie zapomnij użyć pętli.

source: Choose your blocks wisely
pl_pl: Rozważnie dobieraj bloczki

source: Can you find the shortest route? Use your blocks carefully and don't forget the <b>repeat</b> loop.
pl_pl: Potrafisz znaleźć najkrótszą trasę? Dobieraj bloczki z uwagą i nie zapomnij o <b>pętli</b>.

source: Think back to earlier levels - what did you learn
pl_pl: Przypomnij sobie poprzednie poziomy - czego się nauczyłeś

source: Round and Round
pl_pl: W koło

source: Wonky Fish!
pl_pl: Niezdarna rybka!

source: Use <b>repeat until</b> and the <b>if</b> statement to find your way around the Wonky Fish.
pl_pl: Użyj <b>pętli aż</b> oraz konstrukcji <b>if</b>, by znaleźć drogę wokół Niezdarnej Rybki.

source: Think back to earlier levels - what did you learn.
pl_pl: Przypomnij sobie poprzednie poziomy - czego się nauczyłeś.

source: Concrete Wasteland
pl_pl: Betonowa dżungla

source: Use <b>repeat until</b> and the <b>if</b> statement to find your way around the Concrete Wasteland
pl_pl: Użyj <b>pętli aż</b> oraz konstrukcji <b>if</b>, by odnaleźć drogę wokół Betonowej Dżungli

source: This is <b>not...</b> the same
pl_pl: To <b>nie</b> jest to samo

source: Like <b>repeat until</b>, <b>repeat while</b> is the opposite. Here, you want the van to repeat your instructions while it is not at the destination.<br />Doing this means you don't have to work out how many times the van should repeat your instructions.
pl_pl: Pętle <b>aż</b> oraz <b>dopóki</b> są swoimi odwrotnościami. Podczas tego poziomu chciałbyś, by ciężarówka powtarzała Twoje komendy dopóki nie znajdzie się u celu.<br>Jeśli to zrobisz, to nie będziesz musiał się zastanawiać ile razy ciężarówka musi powtórzyć Twoje komendy.

source: The blocks should read like a sentence. Repeat while not at destination then add your instructions using the blocks provided.
pl_pl: Bloczki powinieneś móc przeczytać jak zdanie. Powtarzaj dopóki nie znajdziesz się u celu a wtedy dodaj swoje komendy używając dostępnych bloczków.

source: Snow snake
pl_pl: Śnieżny wąż

source: Combining what you have just learnt using <b>repeat while</b> with the repeat loop, can you find your way around the snow snake?
pl_pl: Potrafisz znaleźć drogę wokół Śnieżnego Węża składając w całość to, co nauczyłeś się o używaniu pętli <b>dopóki</b> wraz ze zwykłą pętlą?

source: The blocks should read like a sentence: <b>repeat while not at destination</b> then using the <b>repeat</b> add your instructions
pl_pl: Bloczki powinieneś móc przeczytać jak zdanie. Powtarzaj dopóki nie znajdziesz się u celu a wtedy używając <b>pętli</b> dodaj swoje komendy

source: Right around the block
pl_pl: Zaraz za blokiem

source: Can you find your way around this puzzle?
pl_pl: Potrafisz rozwiązać tę łamigłówkę?

source: The trick to this level is to <b>turn right</b> then <b>turn around</b>.
pl_pl: Kluczem do rozwiązania jest <b>skręcić w prawo</b> a następnie <b>obrócić się</b>.

source: Can you create the 'Wiggle' procedure?
pl_pl: Potrafisz stworzyć procedurę "Kręciołka"?
