Repository: pypi-data/pypi-mirror-19
Catalog: packages/rapid-router/rapid_router-1.0.0.post0.dev330-py2.py3-none-any.whl/game/locale/*/LC_MESSAGES/django.po
Languages: pl_pl

source: Procedures are groups of instructions that can be executed multiple times without being rewritten. For example, if you want to instruct the van to follow a repeated pattern in the road, you can create a specific procedure. To create a procedure, simply choose the correct blocks and put them in the right order inside the <b>Define do</b> block. Once you have done that, give it a name eg wiggle.<br />Now you're ready! Attach the <b>Call</b> block where you want your 'wiggle' procedure to be executed. Don't forget to put the name in it!
pl_pl: Procedurą nazywamy grupę instrukcji, które mogą być wykonywane wiele razy bez potrzeby przepisywania ich. Dla przykładu, jeśli chcesz, żeby ciężarówka podążała trasą według powtarzalnego schematu, to możesz stworzyć konkretną procedurę. By stworzyć procedurę, wystarczy że wybierzesz właściwe bloczki i ułożysz je w odpowiedniej kolejności wewnątrz bloczku <b>Zdefiniuj</b>. Kiedy to zrobisz nadaj procedurze nazwę np. "Kręciołek". Teraz jesteś gotów! Dołącz bloczek <b>Wywołaj</b> kiedy chcesz wywołać procedurę "Kręciołka". Nie zapomnij wpisać nazwy!

source: Don't forget to use <b>Define</b>. Name your procedure and attach the blocks in the right order. Start with <b>move forwards</b>, <b>turn left</b>, you can add repeat loops to a procedure and ending with <b>turn left</b>. Call your procedure under your start block and off you go...
pl_pl: Nie zapomij użyć bloczka <b>Zdefiniuj</b>. Nazwij swoją procedurę i dołącz bloczki w odpowiedniej kolejności. Zacznij od bloczków <b>Naprzód</b>, <b>Skręć w lewo</b> oraz możesz dodać pętle czy zakończenie bloczkiem <b>Skręć w lewo</b>. Wywołaj swoją procedurę poniżej rozpoczęcia i tyle...

source: Lots of Traffic Lights!
pl_pl: Mnóstwo sygnalizacji świetlnej!

source: Create a procedure which tells the van to wait until the traffic lights are green.
pl_pl: Stwórz procedurę, która spowoduje, że ciężarówka będzie czekać aż światła będą zielone.

source: Don't forget to name your procedure eg 'lights' and every time you want the van to check the traffic lights you need to '<b>call</b>' it.
pl_pl: Nie zapomnij nazwać swojej procedury, dla przykładu "światła". Pamiętaj także, że za każdym razem jak chcesz by ciężarówka czekała na zielone światło, to musisz <b>wywołać</b> procedurę.

source: Wiggle Wiggle
pl_pl: Kręciołek

source: Can you find the repeating pattern here and create a new 'wiggle' procedure? And do the Wiggle Wiggle!
pl_pl: Potrafisz znaleźć powtarzający się tutaj wzór i stworzyć nową procedurę 'kręciołka'?

source: Can you see the repeating pattern in the path? The 'wiggle' consisting of a <b>turn left</b>, <b>move forwards</b>, <b>turn right</b>, <b>turn right</b>, <b>turn left</b> can be put in a <b>Define</b> block to create a procedure. Once you have named it, attach the <b>Call block with the procedure's name in the text box to execute it.
pl_pl: Potrafisz dostrzec powtarzający się wzór w ścieżce? 'Kręciołka' składającego się z <b>skręć w lewo</b>, <b>naprzód</b>, <b>skręć w prawo</b>, <b>skręć w prawo</b>, <b>skręć w lewo</b> można otoczyć blokiem <b>Definiuj</b>, by stworzyć procedurę. Nazwij ją, a później dołącz blok <b>Wywołaj</b> z nazwą procedury w polu tekstowym, by ją wywołać.

source: Muddy Patterns with Phil
pl_pl: Mętne schematy z Philem

source: Can you spot a pattern here? Create several procedures, it can save time when writing a program. Don't forget to clearly name your procedures and then call them.
pl_pl: Potrafisz dostrzec wzór? Stwórz kilka procedur, to może Ci zaoszczędzić czas pisząc program. Nie zapomnij odpowiednio nazwać swoich procedur a później ich wywołać.

source: One procedure could be <b>turn left</b>, <b>turn right</b>, <b>move forwards</b>, <b>turn right</b> and <b>turn left</b>. Don't forget you can create a repeat loop in your procedures.
pl_pl: Jedna z procedur może wyglądać: <b>skręć w lewo</b>, <b>skręć w prawo</b>, <b>naprzód</b>, <b>skręć w prawo</b> i <b>skręć w lewo</b>. Nie zapomnij, że możesz stworzyć pętle powtórz w swoich procedurach.

source: Complicated roads.
pl_pl: Skomplikowane drogi.

source: This road might be a bit more complicated, but the procedures you could come up with are quite simple. Have a go and find out yourself!
pl_pl: Ta droga może być trochę bardziej skomplikowana, jednak procedury, które trzeba wymyślić są całkiem proste. Spróbuj i przekonaj się sam!

source: Your first procedure could be <b>turn left</b> and <b>turn right</b> 'left-right' The second procedure could be <b>turn right</b> <b>turn left</b>, 'right-left'.
pl_pl: Twoja pierwsza procedura mogłaby wyglądać tak: <b>skręć w lewo</b> i <b>skręć w prawo</b>, 'lewo-prawo'. Druga natomiast: <b>skręć w prawo</b> i <b>skręć w lewo</b>, 'prawo-lewo'.

source: Dee's snowy walk
pl_pl: Śnieżny spacer Dee

source: Did you know procedures can call other procedures?
pl_pl: Wiedziałeś, że procedury mogą wywoływać inne procedury?

source: Create 2 procedures. The first one should read <b>move forwards</b>, <b>move forwards</b>, <b>turn right</b>. The second <b>move forwards</b> then <b>call</b> your first procedure
pl_pl: Stwórz dwie procedury. Pierwsza powinna posiadać: <b>naprzód</b>, <b>naprzód</b>, <b>skręć w prawo</b>. Druga natomiast: <b>naprzód</b> a później <b>wywołać</b> pierwszą procedurę.

source: Crazy Farm
pl_pl: Szalona Farma

source: This one will really test what you have learnt.
pl_pl: Tutaj naprawdę przetestujesz to, czego do tej pory się nauczyłeś.

source: It might be easier to write the program without repeats or procedures then create 3 separate procedures from the patterns that your see.
pl_pl: Może prościej będzie napisać program bez pętli i procedur a później stworzyć trzy oddzielne procedury ze wzorów, które widzisz.

source: Can you find the shortest route?
pl_pl: Czy potrafisz znaleźć najkrótszą trasę?

source: Can you find the shortest algorithm?
pl_pl: Czy potrafisz znaleźć najkrótszy algorytm?

source: What is that? A barn for ANTS!?
pl_pl: Co to? Stodoła dla MRÓWEK!?

source: Can you get the van to the house?
pl_pl: Potrafisz pokierować wana do domu?

source: Heard of recursion?
pl_pl: Słyszałeś o rekurencji?

source: Can you get Phil to the house?
pl_pl: Potrafisz poprowadzić Phila do domu?

source: Repeat while not dead end... turn around...
pl_pl: Powtarzaj dopóki nie zastaniesz ślepego zaułka... zawróć...

source: Here's Python!
pl_pl: Oto Python!

source: As you create your program using Blockly see what it looks like in the Python programming language. Can you tell which Python statement matches which block?
pl_pl: Tworząc swój program w Blocky, porównaj jak będzie on wyglądał w Pythonie. Potrafisz stwierdzić, które wyrażenie pasuje do którego bloczka?

source: Matching Blockly
pl_pl: Łączenie bloczków

source: Don't forget to find the shortest route
pl_pl: Nie zapomnij znaleźć najkrótszej drogi

source: Repeating yourself in Python looks different
pl_pl: Powtarzanie instrukcji w Pythonie wygląda inaczej

source: As you create your program using Blockly see what it looks like in the Python programming language. Try adding a <b>repeat</b> block and watch what happens in Python.
pl_pl: Tworząc swój program w Blocky, porównaj jak będzie on wyglądał w Pythonie. Spróbuj dodać pętle <b>Potwórz</b> i zobacz co się stanie w Pythonie.

source: Repeat and watch.
pl_pl: Powtórz i oglądaj.

source: Looks easy but use repeat until and see what happens?
pl_pl: Wygląda prosto, jednak użyj Powtórz dopóki i spójrz co się stanie

source: As you create your program using Blockly see what it looks like in the Python programming language. Try adding a <b>repeat</b> until block and watch what happens in Python.
pl_pl: Tworząc swój program w Blocky, porównaj jak będzie on wyglądał w Pythonie. Spróbuj dodać bloczek <b>Powtórz dopóki</b> i spójrz co się stanie w Pythonie.

source: See what the if blocks looks like in Python
pl_pl: Spójrz jak wygląda bloczek jeżeli w Pythonie

source: As you create your program using Blockly see what it looks like in the Python programming language. Try adding an <b>if</b> block and watch what happens in Python.
pl_pl: Tworząc swój program w Blocky, porównaj jak będzie on wyglądał w Pythonie.. Spróbuj dodać bloczej <b>Jeżeli</b> i spójrz co się stanie w Pythonie.

source: Don't forget to use else if
pl_pl: Nie zapomnij użyć albo jeżeli

source: As you create your program using Blockly see what it looks like in the Python programming language. Try adding an <b>if</b> block and watch what happens in Python particularly with <b>else if</b> and <b>else</b> statements.
pl_pl: Tworząc swój program w Blocky, porównaj jak będzie on wyglądał w Pythonie. Spróbuj dodać bloczek <b>jeżeli</b> i spójrz co się stanie w Pythonie szczególnie z komendami <b>Albo jeżeli</b> i <b>Albo</b>.

source: See what happens when you add Traffic lights
pl_pl: Spójrz co się stanie, kiedy dodasz Sygnalizację świetlną

source: Watch carefully as you have another go
pl_pl: Przypatrz się uważnie podczas tej próby

source: Have a go at procedures - what do they look like in Python?
pl_pl: Spróbuj teraz z procedurami - jak one wyglądają w Pythonie?

source: As you create your program using Blockly see what it looks like in the Python language. Try adding a procedure and watch what happens in Python.
pl_pl: Tworząc swój program w Blocky, porównaj jak będzie on wyglądał w Pythonie. Spróbuj dodać procedurę i spójrz co się stanie w Pythonie.

source: Don't forget to name your procedure and see what happens in Python.
pl_pl: Nie zapomnij nazwać swojej procedury i sprawdź co się stanie w Pythonie.

source: Put it all together
pl_pl: Złóż wszystko w całość

source: Levels
pl_pl: Poziomy

source: Create
pl_pl: Stwórz poziom

source: Clear
pl_pl: Wyczyść

source: Play
pl_pl: Start

source: Step
pl_pl: Krok

source: Solve
pl_pl: Rozwiąż

source: Load
pl_pl: Wczytaj

source: Save
pl_pl: Zapisz

source: Help
pl_pl: Pomoc

source: Night
pl_pl: Noc

source: Quit
pl_pl: Zamknij

source: This is what your program would look like in Python:
pl_pl: A tak wyglądałby twój program, gdyby zapisać go w języku Python:

source: Python Program
pl_pl: Program w języku Python

source: Convert from Blockly
pl_pl: Konwersja z Blockly

source: Use the Python editor below to design your program, and then click play to try it out!
pl_pl: Użyj poniższego pythonowego edytora, by zaprojektować Twoją aplikację. Wciśniej Uruchom, by ją wypróbować!

source: Commands
pl_pl: Polecenia

source: Here you can load a program you've previously saved!
pl_pl: Tutaj możesz wczytać wcześniej zapisany program!

source: You don't have any programs to load yet. Try saving one!
pl_pl: Nie masz żadnych zapisanych programów. Spróbuj najpierw jakiś zapisać!

source: Name
pl_pl: Nazwa

source: Delete
pl_pl: Usuń

source: Here you can save your program so you can retrieve it later!
pl_pl: Tutaj możesz zapisać swój program, żeby można było go później wczytać!

source: Map
pl_pl: Mapa

source: Scenery
pl_pl: Krajobraz

source: Character
pl_pl: Postać

source: Code
pl_pl: Bloczki

source: Random
pl_pl: Wylosuj

source: Share
pl_pl: Udostępnij

source: Here you can design your level! What sort of road will you make?
pl_pl: Tutaj możesz zaprojektować swój poziom! Jaką drogę chcesz zbudować?

source: Max fuel:
pl_pl: Paliwo w baku:

source: Add road
pl_pl: Dodaj drogę

source: Delete road
pl_pl: Usuń drogę

source: Mark start
pl_pl: Start trasy

source: Mark end
pl_pl: Koniec trasy

source: Clear all
pl_pl: Usuń wszystko

source: Here you can liven up your level by choosing the theme and adding scenery! Will you create beautiful countryside or a bustling city?
pl_pl: Tutaj możesz ożywić swój poziom wybierając motyw oraz dodając do niego elementy krajobrazu. Chcesz stworzyć spokojną wieś czy tętniące życiem miasto?

source: Theme:
pl_pl: Motyw:

source: Scenery:
pl_pl: Elementy krajobrazu:

source: Traffic lights:
pl_pl: Światła drogowe:

source: Here you can choose your character. Who will you play as?
pl_pl: Tu możesz wybrać swoją postać. Kim chciałbyś zagrać?

source: Character:
pl_pl: Postać:

source: Here you can select the code you can use while playing your new level!
pl_pl: Tutaj możesz wybrać język lub bloczki, których będzie można używać na twoim nowym poziomie!

source: Language:
pl_pl: Język programowania:

source: Blockly With Python View
pl_pl: Blockly z widokiem kodu w Pythonie

source: Both
pl_pl: Obydwa

source: Select all
pl_pl: Wybierz wszystko

source: Here you can generate a random map. Try changing some of the parameters below and see what you get!
pl_pl: Tu możesz stworzyć losową mapę. Spróbuj zmienić niektóre parametry poniżej i zobacz co się stanie!

source: Size:
pl_pl: Rozmiar trasy:

source: Branchiness:
pl_pl: Rozwidlenia:

source: Loopiness:
pl_pl: Pętle:

source: Curviness:
pl_pl: Zakręty:

source: Traffic Lights:
pl_pl: Światła drogowe:

source: Yes
pl_pl: Tak

source: No
pl_pl: Nie

source: Generate
pl_pl: Stwórz

source: Here you can load in levels created by you and your friends! Select a level in the table and press load.
pl_pl: Tutaj możesz załadować poziomy stworzone przez Ciebie i Twoich znajomych! Wybierz poziom z listy i naciśnij "Otwórz".

source: You don't have any levels to load yet. Try saving one!
pl_pl: Nie masz jeszcze żadnych zapisanych poziomów. Najpierw spróbuj coś zapisać!

source: Load:
pl_pl: Otwórz:

source: your own levels
pl_pl: poziomy stworzone przez Ciebie

source: shared levels
pl_pl: udostępnione poziomy

source: Owner
pl_pl: Autor

source: Here you can save your new level. Enter a name below and hit save. Alternatively click on an existing level to update it.
pl_pl: Tu możesz zapisać swój nowy poziom. Wprowadź poniżej nazwę i kliknij Zapisz. Możesz też kliknąć na istniejącym poziomie aby go zaktualizować.

source: To play your level and be tracked, first <b>Quit</b> the Level Editor and select your level from the 'Levels created by you' section.
pl_pl: Aby zagrać w swój nowy poziom i móc śledzić swoje postępy musisz najpierw <b>Zamknąć</b> edytor a następnie wybrać go z sekcji "Poziomy stworzone przez Ciebie".

source: Name:
pl_pl: Nazwa:

source: Shared
pl_pl: Udostępnione

source: Share with all
pl_pl: Udostępnij wszystkim

source: Levels %(first_level)s-%(last_level)s
pl_pl: Poziomy %(first_level)s-%(last_level)s

source: Random: Try your hand at a random level.
pl_pl: Losowy poziom: Spróbuj swoich sił na losowym poziomie
