Repository: pypi-data/pypi-mirror-19
Catalog: packages/rapid-router/rapid_router-1.0.0.post0.dev330-py2.py3-none-any.whl/game/locale/*/LC_MESSAGES/django.po
Languages: pl_pl

source: You have no permission to see this.
pl_pl: Nie masz uprawnień, aby to zobaczyć.

source: This level is private. You can only see the public levels and the ones created by other users only if they share them with you.
pl_pl: Ten poziom należy do kogoś i nie możesz go zobaczyć, póki ktoś na to nie pozwoli. Możesz zobaczyć jedynie poziomy, które są dla wszystkich oraz cudze, jeśli ktoś się nimi z Tobą podzielił.

source: No permission
pl_pl: Brak uprawnień

source: Scoreboard is only visible to school students and teachers. Log in if you think you should be able to see it.
pl_pl: Tablica z wynikami jest widoczna dla nauczycieli oraz uczniów z danej szkoły. Zaloguj się, jeśli uważasz, że powinna być widoczna dla Ciebie.

source: We were unable to find %(name)s %(surname)s.
pl_pl: Nie mogliśmy znaleźć %(name)s %(surname)s.

source: We were unable to find class %(class)s. Are you sure you got it right?
pl_pl: Nie mogliśmy znaleźć klasy %(class)s. Czy dane na pewno się zgadzają?

source: It seems that you have not created any levels. How about creating one now?
pl_pl: Wygląda na to, że jeszcze nie masz stworzonych jeszcze żadnych poziomów. Może stworzysz jeden teraz?

source: All the levels you have created so far. Click on them to play them or share them with your friends.
pl_pl: Wszystkie poziomy stworzone do tej pory. Kliknij w nie by odtworzyć lub podzielić się nimi ze znajomymi.

source: No one shared a level with you yet.
pl_pl: Jeszcze nikt nie udostępnił Ci żadnego poziomu.

source: Choose a class you want to see.
pl_pl: Wybierz klasę, którą chcesz zobaczyć.

source: You don't have permissions to see this.
pl_pl: Nie masz uprawnień, aby to zobaczyć.

source: Can you find the shortest route?
pl_pl: Czy potrafisz znaleźć najkrótszą trasę?

source: Think back to earlier levels. What did you learn?
pl_pl: Przypomnij sobie poprzednie poziomy. Czego Cię nauczyły?

source: Can you help the van get to the house?
pl_pl: Pomóż kierowcy dotrzeć do celu

source: Choose the right blocks to tell the van where to go. <br> Drag the blocks under the <b>Start</b> block to attach them. <br> To remove a block, drag it into the bin in the bottom right of the screen. <br> When you are happy with your sequence, press <b>Go</b>!
pl_pl: Wybierz odpowiednie bloczki, które powiedzą kierowcy jak dojechać do celu. <br><br> Aby dodać nowy bloczek, przeciągnij go i przyczep poniżej bloczka <b>Start</b>. Aby usunąć bloczek, przeciągnij go do kosza w prawym dolnym rogu ekranu.<br>Kiedy skończysz uruchom program klikając przycisk <b>Go</b>!

source: Drag the <b>Move forwards</b> block so that it is under the <b>Start</b> block - close enough to be touching. <br><br>Clicking on the arrows next to the <b>Go</b> button will also drag the blocks into a sequence for you. <br><br>Don't forget to press <b>Go</b> when you are done.
pl_pl: Przeciągnij bloczek <b>Move forwards</b> tak, aby znalazł się tuż pod bloczkiem <b>Start</b>. Bloczki powinny stykać się ze sobą. <br><br>Klikając w strzałkę obok przycisku <b>Go</b>, dodasz odpowiadający jej bloczek do programu.<br><br>Nie zapomnij o kliknięciu przycisku <b>Go</b> kiedy skończysz.

source: This time the house is further away.
pl_pl: Tym razem cel jest nieco dalej

source: A block can be placed next to or under another, like a jigsaw. A second <b>Move forwards</b> block can be placed under the first <b>Move forwards</b> block. <br> To remove a block, drag it back to the left of the screen or drop it in the bin. <br> When you are happy with your sequence, press <b>Go</b>!
pl_pl: Bloczki można umieszczać obok siebie lub jeden pod drugim, zupełnie tak jak puzzle. Drugi bloczek <b>Move forwards</b> możesz umieścić pod pierwszym bloczkiem <b>Move forwards</b>. <br><br> Aby usunąć bloczek, przeciągnij go z powrotem na lewą stronę ekranu albo wrzuć do kosza. Kiedy skończysz, uruchom program klikając przycisk <b>Go</b>!

source: A second <b>Move forwards</b> block can be placed under the first <b>Move forwards</b> block. <br><br>The arrows next to the <b>Go</b> button will drag the blocks into a sequence for you.
pl_pl: Drugi bloczek <b>Move forwards</b> umieść tuż pod pierwszym bloczkiem <b>Move forwards</b>. <br><br>Klikając w strzałkę obok przycisku <b>Go</b>, dodasz odpowiadający jej bloczek do programu.

source: Can you make the van turn right?
pl_pl: Czy potrafisz skręcić w prawo?

source: This time, the van has to turn right to reach the house. Make sure you use the <b>Turn right</b> block in your sequence. <br> Drag the blocks and attach them under the <b>Start</b> block like before. To remove a block, drag it back to the left of the screen or drop it in the bin. <br> When you are happy with your sequence, press <b>Go</b>!
pl_pl: Tym razem aby dotrzeć do celu, samochód będzie musiał skręcić w prawo. Upewnij się, że w swoim programie użyjesz bloczka <b>Turn right</b>. <br><br>Przeciągnij bloczki i dołącz je pod <b>Start</b> tak jak poprzednio. Aby usunąć bloczek, przeciągnij go z powrotem na lewą stronę ekranu albo wrzuć do kosza. Kiedy skończysz, uruchom program klikając przycisk <b>Go</b>!

source: A <b>Turn right</b> block can be placed under the first <b>Move forwards</b> block. <br><br> The arrows next to the <b>Go</b> button will drag the blocks into a sequence for you.
pl_pl: Bloczek <b>Turn right</b> umieść pod pierwszym bloczkiem <b>Move forwards</b>. <br><br>Klikając w strzałkę obok przycisku <b>Go</b>, dodasz odpowiadający jej bloczek do programu.

source: You are getting good at this! Let's try turning left.
pl_pl: Dobrze Ci idzie! Teraz spróbuj skręcić w lewo

source: This time the van has to go left. Make sure you use the <b>Turn left</b> block in your sequence. <br> Drag and attach the blocks like before. <br> When you are happy with your sequence, press <b>Go</b>!
pl_pl: Tym razem samochód ma skręcić w lewo. Upewnij się, że w swoim programie użyjesz bloczka <b>Turn left</b>. <br><br>Przeciągnij i dołącz bloczki jak poprzednio. Kiedy skończysz, uruchom program klikając przycisk <b>Go</b>!

source: A <b>Turn left</b> block can be placed under a series of <b>Move forwards</b> blocks. <br> The arrows next to the <b>Go</b> button will drag the blocks into a sequence for you.
pl_pl: Bloczek <b>Turn left</b> umieść pod kilkoma bloczkami <b>Move forwards</b>. <br><br>Klikając w strzałkę obok przycisku <b>Go</b>, dodasz odpowiadający jej bloczek do programu.

source: Good work! You are ready for something harder.
pl_pl: Znakomicie! Czas na coś trudniejszego

source: You already know how to make the van turn left or right. This time the van has to make lots of turns to reach the house. <br> Drag and attach the blocks to make your sequence.<br> When you are happy with your sequence, press <b>Go</b>!
pl_pl: Już wiesz jak skręcać w lewo i w prawo. Tym razem samochód będzie musiał pokonać mnóstwo zakrętów zanim dotrze do celu. <br><br>Przeciągnij i dołącz bloczki, aby stworzyć program. Kiedy skończysz, uruchom go klikając przycisk <b>Go</b>!

source: This road starts by curving to the <b>left</b>. Then it curves to the <b>right</b>. <br><br> The arrows next to the <b>Go</b> button will drag the blocks into a sequence for you.
pl_pl: Ta droga zaczyna się od zakrętu <b>w lewo</b>. Kolejny zakręt jest <b>w prawo</b>.<br><br>Klikając w strzałkę obok przycisku <b>Go</b>, dodasz odpowiadający jej bloczek do programu.

source: Well done! Let's use all three blocks.
pl_pl: Świetnie! A teraz użyj wszystkich trzech bloczków

source: This time the van has to <b>Move forwards</b>, <b>Turn left</b> and <b>Turn right</b>. <br><br> Drag and attach the blocks like before. <br> When you are happy with your sequence, press <b>Go</b>!
pl_pl: Tym razem samochód musi jechać prosto (bloczek <b>Move forwards</b>), skręcać w lewo (bloczek <b>Turn left</b>) i w prawo (bloczek <b>Turn right</b>). <br><br>Przeciągnij i dołącz bloczki tak jak wcześniej. Kiedy skończysz, uruchom program klikając przycisk <b>Go</b>!

source: Follow the road around. How many <b>Move forwards</b> do you need? <br><br>The arrows next to the <b>Go</b> button will drag the blocks into a sequence for you.
pl_pl: Policz ile ruchów do przodu (bloczków <b>Move forwards</b>) potrzebujesz? <br><br>Klikając w strzałkę obok przycisku <b>Go</b>, dodasz odpowiadający jej bloczek do programu.

source: This road is more complicated.
pl_pl: Czas na coś trudniejszego

source: Practise your new skills on this road by helping the driver to arrive at the house. <br> When you are happy with your sequence, press <b>Go</b>!
pl_pl: Poćwicz swoje nowe umiejętności na tej drodze, pomagając kierowcy dotrzeć do domu. <br><br> Kiedy skończysz układać bloczki, uruchom program klikając przycisk <b>Go</b>!

source: Follow the road around. Don't forget to <b>Turn left</b> first. <br><br>The arrows next to the <b>Go</b> button will drag the blocks into a sequence for you.
pl_pl: Przyjrzyj się drodze. Zacznij od skrętu w lewo (bloczek <b>Turn left</b>).<br><br>Klikając w strzałkę obok przycisku <b>Go</b>, dodasz odpowiadający jej bloczek do programu.

source: The warehouse is not always in the same place.
pl_pl: Początek trasy nie zawsze jest w tym samym miejscu

source: This time the warehouse is somewhere else on the screen but you still need to use the <b>Move forwards</b> block. <br> Can you use the <b>Move forwards</b> block correctly even when it looks like the van goes in a different direction? <br> When you are happy with your sequence, press <b>Go</b>!
pl_pl: Tym razem początek trasy znajduje się na górze, ale wciąż należy użyć bloczka <b>Move forwards</b> aby przesunąć samochód do przodu.<br><br>Kiedy skończysz, uruchom program klikając przycisk <b>Go</b>!

source: On screen, the van looks like it follows the road down. If you were in the van, it would look like you should <b>Move forwards</b>, then <b>Turn right</b>.
pl_pl: Na ekranie samochód wygląda jakby jechał drogą z góry na dół, ale gdybyś był kierowcą, to widziałbyś, że należy jechać drogą do przodu (bloczek <b>Move forwards</b>), a następnie skręcić w prawo (bloczek <b>Turn right</b>).

source: Can you go from right to left?
pl_pl: Z lewej strony na prawą

source: How many times do you have to <b>Move forwards</b> before you <b>Turn left</b>?
pl_pl: Ile razy należy pojechać do przodu (bloczek <b>Move forwards</b>) zanim skręcisz w lewo (bloczek <b>Turn left</b>)?

source: Well done! How about another go?
pl_pl: Dobra robota! Jedziemy dalej?

source: You've done really well so far. Try to get the van to the house. <br> When you are happy with your sequence, press <b>Go</b>!
pl_pl: Świetnie Ci idzie! Spróbuj dojechać samochodem do domu.<br>Kiedy skończysz układać bloczki, uruchom program klikając przycisk <b>Go</b>!

source: This map is not so hard. Notice that to you it looks like the road goes up, but if you were in the in the van, you would see the road goes right. <br><br> Do you know which turn the van will take next? <br><br> The arrows next to the <b>Go</b> button will drag the blocks into a sequence for you.
pl_pl: Ta mapa wcale nie jest taka trudna. Zauważ, że choć droga wygląda jakby zakręcała do góry, to z wnętrza samochodu widziałbyś, że skręca w prawo.<br><br>Czy już wiesz w którą stronę samochód pojedzie na kolejnym zakręcie?<br><br>Klikając w strzałkę obok przycisku <b>Go</b>, dodasz odpowiadający jej bloczek do programu.

source: Snail maze!
pl_pl: Kręty ślimak!

source: Uh oh, a tricky snail maze! Can you take the van through it? <br> When you are happy with your sequence, press <b>Go</b>!
pl_pl: O, ta droga kształtem przypomina ślimaka! Czy potrafisz poprowadzić nią samochód?<br>Kiedy skończysz układać bloczki, uruchom program klikając przycisk <b>Go</b>!

source: The maze looks a bit like a snail, doesn't it? That means that for most of the time the van should only <b>Move forwards</b> and <b>Turn right</b>. <br><br> The arrows next to the <b>Go</b> button will drag the blocks into a sequence for you.
pl_pl: Ta droga kształtem przypomina ślimaka, prawda? To znaczy, że przez większość czasu samochód będzie musiał jechać prosto (bloczek <b>Move forwards</b>) i co jakiś czas skręcać w prawo (bloczek <b>Turn right</b>). <br><br>Klikając w strzałkę obok przycisku <b>Go</b>, dodasz odpowiadający jej bloczek do programu.

source: Good work, by now you are able to solve quite complicated levels. Prove your skills! <br> When you are happy with your sequence, press <b>Go</b>!
pl_pl: Dobra robota! Do tej pory udało Ci się pokonać dość skomplikowane poziomy. Czas sprawdzić Twoje umiejętności! <br><br> Kiedy skończysz układać bloczki, uruchom program klikając przycisk <b>Go</b>!

source: This road might look much longer and more complicated, but it's not that hard. <br> Start by using <b>Move forwards</b> a few steps and <b>Move left</b>.
pl_pl: Ta droga może wydawać się dłuższa i bardziej skomplikowana, ale wcale nie jest taka trudna. <br> Zacznij od jazdy do przodu (bloczek <b>Move forwards</b>), a po kilku ruchach skręć w lewo (bloczek <b>Turn left</b>).

source: Multiple routes
pl_pl: Wiele możliwych tras

source: Often there is more than one way to get to the house. The route that needs the fewest directions is usually best. <br> Help the van find the shortest route to the house. <br> You can press the <b>Go</b> or <b>Play</b> buttons to start the van.
pl_pl: Często kilka dróg prowadzi do celu, przeważnie najkrótsza jest najlepsza. Spraw by samochód dotarł najkrótszą trasą do domu.<br><br> Kliknij przycisk <b>Go</b> lub <b>Play</b>, aby rozpocząć.

source: Try taking the route that starts by turning left then turns right. Do you know what follows next?
pl_pl: Spróbuj pojechać trasą, która zaczyna się od skrętu w lewo, a następnie skręca w prawo. Czy wiesz jaki powinien być Twój kolejny ruch?

source: Can you spot the shortest route?
pl_pl: Która droga jest najkrótsza?

source: So many options to choose from! <br> Do you know which is the shortest route to get the van to house?
pl_pl: Tak wiel opcji do wyboru! <br> Czy potrafisz znaleźć najkrótszą trasę, która zaprowadzi samochód do celu?

source: The middle route seems to be shortest. Do you know what sequence of instructions will make the van follow it?
pl_pl: Trasa biegnąca przez środek mapy wygląda na najkrótszą. Czy wiesz w jakiej kolejności poukładać bloczki, aby samochód pojechał właśnie tą drogą?

source: What if there is more than one delivery?
pl_pl: Co jeśli jest więcej dostaw?

source: Our vans often need to go to more than one house. To make the van deliver to a house use the <b>Deliver</b> block. <br> Make sure your sequence gets the van to travel the shortest route!
pl_pl: Nasze samochody często muszą odwiedzić więcej niż jeden dom. Aby dostarczyć zakupy użyj bloczka <b>Deliver</b>. <br><br>Upewnij się, że zaplanowana trasa jest jak najkrótsza!

source: Make the van turn left and go directly to the closest house first. This is the shortest route. <br><br> The <b>Deliver</b> block is not needed when the van is only going to one house, but you need it when the van is going to two or more houses. <br><br> Use the <b>Deliver</b> block every time the van gets to a house.
pl_pl: Zacznij od skrętu w lewo i jedź do najbliższego domu - to najkrótsza trasa. <br><br>Bloczek <b>Deliver</b> nie jest potrzebny, jeśli samochód robi dostawę tylko do jednego domu, ale będziesz go potrzebować, jeżeli domów jest więcej. <br><br>Użyj bloczka <b>Deliver</b> za każdym razem, kiedy van zatrzymuje się obok domu.

source: This time there are even more houses.
pl_pl: Tym razem domów jest jeszcze więcej

source: Well done! You have done really well to get so far - let's take it to the next level and add another house. <br> Can you work out the shortest, most efficient route to each house?
pl_pl: Dobra robota! Skoro tak świetnie sobie radzisz - spróbuj czegoś trudniejszego i&nbsp;dostarcz zakupy do trzech domów. <br>Czy uda Ci się wyznaczyć najkrótszą trasę?

source: Although the <b>Deliver</b> block is not needed when there is only one house, you need it when there are more houses, like now. <br><br>Once the van is at a house, make sure you use the <b>Deliver</b> block. Do that for each house.
pl_pl: Gdy na trasie jest więcej niż jeden dom, skorzystaj z bloczka <b>Deliver</b>, aby dostarczyć zakupy. <br><br>Upewnij się, że używasz tego bloczka za każdym razem, kiedy samochód zatrzymuje się obok domu.

source: House overload!
pl_pl: Jeszcze więcej domów!

source: Well done, you're getting a hang of it! Can you do the same for even more houses?<br> Don't forget to use the <b>Deliver</b> block at each house.
pl_pl: Brawo! Stajesz się prawdziwym ekspertem! Czy potrafisz zrobić to samo dla jeszcze większej liczby domów? <br>Pamiętaj o użyciu bloczka <b>Deliver</b> by dostarczyć zakupy do każdego z nich.

source: Test your sequence to make sure that the van takes the shortest route to visit all the houses on the way. <br><br> Use the <b>Deliver</b> block every time the van gets to a house.
pl_pl: Upewnij się, czy wybrałeś najkrótszą trasę by dostarczyć zakupy. <br><br> Użyj bloczka <b>Deliver</b> za każdym razem, kiedy samochód dojeżdża do domu.

source: This one is quite a tangle.
pl_pl: Te drogi są nieźle poplątane

source: Practise your new skills on this road by getting the van to <b>Deliver</b> to each of the houses.
pl_pl: Trening czyni mistrza! Spróbuj ponownie dostarczyć zakupy do każdego z domów używając bloczków <b>Deliver</b>.

source: To make sure the van takes the shortest route, first turn left. <br><br> Use the <b>Deliver</b> block every time the van gets to a house.
pl_pl: Aby mieć pewność, że samochód pojedzie najkrótszą trasą, skręć najpierw w lewo. <br><br> Użyj bloczka <b>Deliver</b> za każdym razem, kiedy van zatrzymuje się obok domu.

source: Repeating yourself is boring.
pl_pl: Powtarzanie jest nudne

source: Attach a block inside the <b>Repeat</b> block to make the van repeats that instruction. <br> This means you can use one block instead of lots of blocks to do the same thing over and over again. <br> How many times do you want the instruction repeated? Type the number into the <b>Repeat</b> block. <br> The repeated sets of blocks make a 'loop'. <br><br> When you are ready, press <b>Play</b>!
pl_pl: Umieść dowolny bloczek wewnątrz bloczka <b>Repeat</b>, a samochód powtórzy to polecenie. Zauważ, że możesz użyć jednego zamiast wielu bloczków i powtarzać te same polecenia w kółko. Powtarzające się zestawy bloczków tworzą "pętlę". <br><br>Ile razy chcesz powtórzyć pętlę? Wpisz w bloczku <b>Repeat</b> liczbę powtórzeń. Kiedy skończysz układać bloczki, kliknij <b>Play</b>!

source: A <b>Move forwards</b> block can be placed inside a <b>Repeat</b> block (to the right of the word 'Do'). <br><br> Don't forget to change the number of times you need to repeat the instruction.
pl_pl: Bloczek <b>Move forwards</b> można umieścić wewnątrz bloczka <b>Repeat</b> (po prawej stronie słowa "Do"). <br><br>Nie zapomnij zmienić liczby powtórzeń.

source: Use the <b>Repeat</b> block to make your sequence shorter and simpler.
pl_pl: Użyj pętli, żeby skrócić i uprościć program

source: You drove the van down this road on Level 5. This time, use the <b>Repeat</b> block to get the van to the house. <br> This will make your sequence shorter and simpler than last time.
pl_pl: Prowadziliśmy już samochód tą drogą na poziomie 5. Tym razem użyj pętli (bloczek <b>Repeat</b>), aby doprowadzić go do celu. To sprawi, że Twój program będzie krótszy i prostszy niż ostatnim razem.

source: This level can be broken down into three repeated sets of: <b>Turn left</b>, then <b>Turn right</b>. <br><br> These repeated steps make a 'loop'.
pl_pl: Ten poziom można ukończyć powtarzając trzykrotnie zestaw poleceń: skręć w lewo (bloczek <b>Turn left</b>), a następnie skręć w prawo (bloczek <b>Turn right</b>).<br><br>Takie powtarzanie poleceń tworzy "pętlę".

source: Four leaf clover.
pl_pl: Czterolistna koniczyna

source: This path looks a bit like a four leaf clover. Can you take the driver through it?
pl_pl: Ta trasa przypomina czterolistną koniczynę. Czy potrafisz poprowadzić przez nią naszego kierowcę?

source: This level can be broken down into repeated sets of: <b>Move forwards</b>, <b>Turn left</b>, <b>Turn right<b>, <b>Turn left</b>.
pl_pl: Ten poziom można pokonać powtarzając zestaw poleceń: jedź prosto (bloczek <b>Move forwards</b>), skręć w lewo (bloczek <b>Turn left</b>), skręć w prawo (bloczek <b>Turn right</b>), skręć w lewo (bloczek <b>Turn left</b>).

source: Now things are getting quite long and complicated.
pl_pl: Sprawy zaczynają się nieco komplikować

source: An algorithm (a set of instructions in a particular order) to get the van to the house might not be very simple, but it can be made shorter by using the <b>Repeat</b> blocks. <br> Are you up for this challenge?
pl_pl: Algorytm (zestaw poleceń ułożonych w określonej kolejności), który poprowadzi samochód do domu może być skomplikowany. Czy podejmiesz wyzwanie i&nbsp;skrócisz go za pomocą bloczków <b>Repeat</b>?

source: Look to see where you have used <b>Move forwards</b>, <b>Turn left</b> and <b>Turn right</b> blocks. Are any blocks next to them the same? Put them into one <b>Repeat</b> block. Don't forget to change the number of times you need to repeat the instruction.
pl_pl: Popatrz gdzie są bloczki <b>Move forwards</b>, <b>Turn left</b> i <b>Turn right</b>. Czy widzisz obok nich powtarzające się bloczki? Umieść je razem wewnątrz jednego bloczka <b>Repeat</b>. Nie zapomnij o zmianie liczby powtórzeń.

source: Sssssssssnake!
pl_pl: Wąż!

source: This road seems to be winding just like a snake! Can you find a nice and simple route to get the van to the house?
pl_pl: Ta droga wije się niczym wąż! Czy potrafisz ułożyć prosty program, który doprowadzi samochód do celu?

source: How about using <b>Repeat</b> inside another <b>Repeat</b>? <br><br> This level can be broken down into sets of: <li> a set (nested loop) of <b>Move forwards</b>, </li> <li> two <b>Turn left</b>s, </li> <li> a set (nested loop) of <b>Move forwards</b>, </li> <li> two <b>Turn right</b>s. </li>
pl_pl: Co powiesz na to, żeby użyć bloczka <b>Repeat</b> wewnątrz innego bloczka <b>Repeat</b>? <br><br> Ten poziom można ukończyć dzieląc przejazd na etapy: <li> pętla z poleceniami jedź prosto (bloczek <b>Move forwards</b>),</li> <li> dwa razy skręć w lewo (bloczek <b>Turn left</b>), </li> <li> pętla z poleceniami jedź prosto (bloczek <b>Move forwards</b>), </li><li> dwa razy skręć w prawo (bloczek <b>Turn right</b>).</li>

source: The road is very long and very bendy.
pl_pl: Ta droga jest kręta i bardzo długa

source: Wow! Look at that! It won't get more complicated than this, we promise.
pl_pl: Spójrz tylko na tę trasę! Bardziej skomplikowanych już nie będzie, obiecujemy.

source: With all these twists and turns, you will have to think hard about what sets of repeated instructions to use. <br><br>
pl_pl: Przy tych wszystkich zakrętach musisz się dobrze zastanowić jakich poleceń użyć i jak pogrupować je w pętle (bloczek <b>Repeat</b>).<br><br>

source: Waterfall level.
pl_pl: Wodospad

source: Since you did so well with the repeat loops, have a go at this level.
pl_pl: Skoro tak dobrze Ci poszło z pętlami, sprawdź swoje umiejętności na tym poziomie.

source: Most of the program will consist of repeated sets of <b>Move forwards</b> and a set of <b>Turn right</b> and <b>Turn left</b>.
pl_pl: Większość tego programu będzie złożona z powtarzających się poleceń "jedź prosto" (bloczek <b>Move forwards</b>) oraz zestawu poleceń "skręć w prawo" i "skręć w lewo" (bloczki <b>Turn right</b> i <b>Turn left</b>).

source: Winter wonderland!
pl_pl: Zimowa kraina
