Repository: pypi-data/pypi-mirror-19
Catalog: packages/collective.blueline/collective.blueline-1.0b1-py2-none-any.whl/collective/blueline/locales/*/LC_MESSAGES/collective.blueline.po
Languages: es, pt_br

source: Above Content
es: Encima del contenido
pt_br: Acima do conteúdo

source: Below Content
es: Debajo del contenido
pt_br: Embaixo do conteúdo

source: Below Content Body
es: Debajo del cuerpo del texto
pt_br: Embaixo do corpo do texto

source: By default, viewlets will be visible for anonymous users only. If selected, the code will be shown to authenticated users also.
es: Por defecto, los viewlets son visibles para usuarios anónimos solamente. Si se selecciona esta opción, el código será también mostrado para usuarios autenticados.
pt_br: Por padrão, os viewlets são visíveis só para usuários anónimos. Se selecionado, o código será também mostrado para usuários autenticados.

source: Footer
es: Pie de página
pt_br: Rodapé

source: HTML Head
es: Encabezado HTML
pt_br: Cabeçalho HTML

source: Header
es: Encabezado
pt_br: Cabeçalho

source: Helper viewlets to easily insert code on the layout of a Plone site.
pt_br: Viewlets para inserir código fácilmente no layout de um Plone site.

source: Invalid code:
es: Código inválido:
pt_br: Código inválido:

source: Remove collective.blueline package.
es: Desinstalar Blueline.
pt_br: Remover o Blueline.

source: Settings for the collective.blueline package
es: Configuración de Blueline
pt_br: Configurações do Blueline

source: Show to authenticated users?
es: ¿Mostrar para usuarios autenticados?
pt_br: Mostrar para usuários autenticados?

source: This code will be included above the content of the page.
es: Este código será incluido encima del contenido de la página.
pt_br: Este código será incluso acima do conteúdo da página.

source: This code will be included at the end of the page.
es: Este código será incluido al final de la página.
pt_br: Este código será incluso no final da página.

source: This code will be included at the top of the page.
es: Este código será incluido en la parte superior de la página.
pt_br: Este código será incluso na parte superior da página.

source: This code will be included below the body of the content of the page.
es: Este código será incluido debajo del cuerpo del texto de la página.
pt_br: Este código será incluso embaixo do corpo do texto da página.

source: This code will be included below the content of the page.
es: Este código será incluido debajo de contenido de la página.
pt_br: Este código será incluso embaixo do conteúdo da página.

source: This code will be included inside the head tag.
es: Este código será incluido dentro de la etiqueta <head>.
pt_br: Este código será incluso dentro da tag <head> da página.
