Repository: pypi-data/pypi-mirror-19
Catalog: packages/ztfy.media/ztfy.media-0.1.12-py2.7.egg/ztfy/media/locales/*/LC_MESSAGES/ztfy.media.po
Languages: fr

source: OGG audio converter
fr: Conversion audio OGG

source: FLV (Flash Video) video converter
fr: Conversion vidéo Flash (FLV)

source: MP4 (HTML5) video converter
fr: Conversion vidéo MP4

source: OGG video converter
fr: Conversion vidéo OGG

source: WebM video converter
fr: Conversion vidéo WebM

source: WAV audio converter
fr: Conversion audio WAV

source: MP3 audio converter
fr: Conversion audio MP3

source: Medias converter process address
fr: Adresse du processus de conversion de médias

source: Address of media converter listener, in the 'IPv4:port' format.Keep empty to disable it.
fr: Adresse du processus d'écoute du convertisseur de médias, sous la forme 'IPv4:port'.Laissez le champ vide pour le désactiver.

source: Video formats conversions
fr: Formats de conversion vidéo

source: Published video files will be automatically converted to this format
fr: Les vidéos publiées seront automatiquement converties dans ces formats

source: Force video conversion?
fr: Forcer la conversion vidéo

source: Convert video even when source file has same target content type
fr: Convertir les vidéos dans tous les formats, même lorsqu'elles sont fournies dans l'un des formats cibles

source: Audio formats conversions
fr: Formats de conversion audio

source: Published audio files will be automatically converted to this format
fr: Les fichiers audio publiés seront automatiquement convertis dans ces formats

source: Force audio conversion?
fr: forcer la conversion audio

source: Convert audio file even when source file has same target content type
fr: Convertir les fichiers audios dans tous les formats, même lorsqu'elles sont fournies dans l'un des formats cibles

source: ZEO connection name
fr: Nom de la connexion ZEO

source: Name of ZEO connection utility defining converter connection
fr: Nom de la connection ZEO utilisée par le processus de conversion

source: Media type
fr: Type de média

source: Media audio codec name
fr: Nom du codec audio

source: Media video codec name
fr: Nom du codec vidéo

source: Media duration, in seconds
fr: Durée du média, en secondes

source: Media audio bitrate
fr: Débit audio

source: Media video frames rate
fr: Fréquence des trames vidéo

source: Media frame size, if available
fr: Définition (pour les vidéos)

source: Media frame mode, if available
fr: Fréquence des images (pour les vidéos)

source: Complete media infos dictionary
fr: Informations complètes sur le média

source: Media converter label
fr: Libellé du convertisseur

source: Media converter target format
fr: Format cible du convertisseur
